[{"1":{"Kind":1}},{"1":{"Kind":2}},{"1":{"Kind":3}},{"1":{"Kind":4}},{"1":{"Kind":5}},{"1":{"Kind":6}},{"1":{"Kind":7}},{"1":{"Kind":8}},{"2":{"Name":"RoutingStrategy","Properties":{"FleetId":{"Type":4,"Flags":0,"Description":"A unique identifier for a fleet that the alias points to. If you specify SIMPLE for the Type property, you must specify this property."},"Message":{"Type":4,"Flags":0,"Description":"The message text to be used with a terminal routing strategy. If you specify TERMINAL for the Type property, you must specify this property."},"Type":{"Type":4,"Flags":1,"Description":"Simple routing strategy. The alias resolves to one specific fleet. Use this type when routing to active fleets."}}}},{"2":{"Name":"AWS.GameLift/AliasProperties","Properties":{"AliasId":{"Type":4,"Flags":18,"Description":"Unique alias ID"},"Description":{"Type":4,"Flags":0,"Description":"A human-readable description of the alias."},"Name":{"Type":4,"Flags":1,"Description":"A descriptive label that is associated with an alias. Alias names do not need to be unique."},"RoutingStrategy":{"Type":8,"Flags":1,"Description":"A routing configuration that specifies where traffic is directed for this alias, such as to a fleet or to a message."}}}},{"2":{"Name":"AWS.GameLift/Alias","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":9,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.GameLift/Alias@default","ScopeType":0,"Body":10}},{"2":{"Name":"StorageLocation","Properties":{"Bucket":{"Type":4,"Flags":1,"Description":"An Amazon S3 bucket identifier. This is the name of the S3 bucket."},"Key":{"Type":4,"Flags":1,"Description":"The name of the zip file that contains the build files or script files."},"ObjectVersion":{"Type":4,"Flags":0,"Description":"The version of the file, if object versioning is turned on for the bucket. Amazon GameLift uses this information when retrieving files from your S3 bucket. To retrieve a specific version of the file, provide an object version. To retrieve the latest version of the file, do not set this parameter."},"RoleArn":{"Type":4,"Flags":1,"Description":"The Amazon Resource Name (ARN) for an IAM role that allows Amazon GameLift to access the S3 bucket."}}}},{"2":{"Name":"AWS.GameLift/BuildProperties","Properties":{"BuildId":{"Type":4,"Flags":18,"Description":"A unique identifier for a build to be deployed on the new fleet. If you are deploying the fleet with a custom game build, you must specify this property. The build must have been successfully uploaded to Amazon GameLift and be in a READY status. This fleet setting cannot be changed once the fleet is created."},"Name":{"Type":4,"Flags":0,"Description":"A descriptive label that is associated with a build. Build names do not need to be unique."},"OperatingSystem":{"Type":4,"Flags":0,"Description":"The operating system that the game server binaries are built to run on. This value determines the type of fleet resources that you can use for this build. If your game build contains multiple executables, they all must run on the same operating system. If an operating system is not specified when creating a build, Amazon GameLift uses the default value (WINDOWS_2012). This value cannot be changed later."},"ServerSdkVersion":{"Type":4,"Flags":4,"Description":"A server SDK version you used when integrating your game server build with Amazon GameLift. By default Amazon GameLift sets this value to 4.0.2."},"StorageLocation":{"Type":12,"Flags":4,"Description":"Information indicating where your game build files are stored. Use this parameter only when creating a build with files stored in an Amazon S3 bucket that you own. The storage location must specify an Amazon S3 bucket name and key. The location must also specify a role ARN that you set up to allow Amazon GameLift to access your Amazon S3 bucket. The S3 bucket and your new build must be in the same Region."},"Version":{"Type":4,"Flags":0,"Description":"Version information that is associated with this build. Version strings do not need to be unique."}}}},{"2":{"Name":"AWS.GameLift/Build","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":13,"Flags":0,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.GameLift/Build@default","ScopeType":0,"Body":14}},{"2":{"Name":"AnywhereConfiguration","Properties":{"Cost":{"Type":4,"Flags":1,"Description":"Cost of compute can be specified on Anywhere Fleets to prioritize placement across Queue destinations based on Cost."}}}},{"2":{"Name":"CertificateConfiguration","Properties":{"CertificateType":{"Type":4,"Flags":1}}}},{"2":{"Name":"IpPermission","Properties":{"FromPort":{"Type":3,"Flags":1,"Description":"A starting value for a range of allowed port numbers."},"IpRange":{"Type":4,"Flags":1,"Description":"A range of allowed IP addresses. This value must be expressed in CIDR notation. Example: \"000.000.000.000/[subnet mask]\" or optionally the shortened version \"0.0.0.0/[subnet mask]\"."},"Protocol":{"Type":4,"Flags":1,"Description":"The network communication protocol used by the fleet."},"ToPort":{"Type":3,"Flags":1,"Description":"An ending value for a range of allowed port numbers. Port numbers are end-inclusive. This value must be higher than FromPort."}}}},{"2":{"Name":"Location"}},{"2":{"Name":"LocationCapacity","Properties":{"DesiredEC2Instances":{"Type":3,"Flags":1,"Description":"The number of EC2 instances you want to maintain in the specified fleet location. This value must fall between the minimum and maximum size limits."},"MaxSize":{"Type":3,"Flags":1,"Description":"The maximum value that is allowed for the fleet's instance count for a location. When creating a new fleet, GameLift automatically sets this value to \"1\". Once the fleet is active, you can change this value."},"MinSize":{"Type":3,"Flags":1,"Description":"The minimum value allowed for the fleet's instance count for a location. When creating a new fleet, GameLift automatically sets this value to \"0\". After the fleet is active, you can change this value."}}}},{"2":{"Name":"LocationConfiguration","Properties":{"Location":{"Type":4,"Flags":1},"LocationCapacity":{"Type":20,"Flags":0}}}},{"2":{"Name":"ResourceCreationLimitPolicy","Properties":{"NewGameSessionsPerCreator":{"Type":3,"Flags":0,"Description":"The maximum number of game sessions that an individual can create during the policy period."},"PolicyPeriodInMinutes":{"Type":3,"Flags":0,"Description":"The time span used in evaluating the resource creation limit policy."}}}},{"2":{"Name":"RuntimeConfiguration","Properties":{"GameSessionActivationTimeoutSeconds":{"Type":3,"Flags":0,"Description":"The maximum amount of time (in seconds) that a game session can remain in status ACTIVATING. If the game session is not active before the timeout, activation is terminated and the game session status is changed to TERMINATED."},"MaxConcurrentGameSessionActivations":{"Type":3,"Flags":0,"Description":"The maximum number of game sessions with status ACTIVATING to allow on an instance simultaneously. This setting limits the amount of instance resources that can be used for new game activations at any one time."},"ServerProcesses":{"Type":27,"Flags":0,"Description":"A collection of server process configurations that describe which server processes to run on each instance in a fleet."}}}},{"2":{"Name":"ScalingPolicy","Properties":{"ComparisonOperator":{"Type":4,"Flags":0,"Description":"Comparison operator to use when measuring a metric against the threshold value."},"EvaluationPeriods":{"Type":3,"Flags":0,"Description":"Length of time (in minutes) the metric must be at or beyond the threshold before a scaling event is triggered."},"Location":{"Type":4,"Flags":0},"MetricName":{"Type":4,"Flags":1,"Description":"Name of the Amazon GameLift-defined metric that is used to trigger a scaling adjustment."},"Name":{"Type":4,"Flags":1,"Description":"A descriptive label that is associated with a fleet's scaling policy. Policy names do not need to be unique."},"PolicyType":{"Type":4,"Flags":0,"Description":"The type of scaling policy to create. For a target-based policy, set the parameter MetricName to 'PercentAvailableGameSessions' and specify a TargetConfiguration. For a rule-based policy set the following parameters: MetricName, ComparisonOperator, Threshold, EvaluationPeriods, ScalingAdjustmentType, and ScalingAdjustment."},"ScalingAdjustment":{"Type":3,"Flags":0,"Description":"Amount of adjustment to make, based on the scaling adjustment type."},"ScalingAdjustmentType":{"Type":4,"Flags":0,"Description":"The type of adjustment to make to a fleet's instance count."},"Status":{"Type":4,"Flags":0,"Description":"Current status of the scaling policy. The scaling policy can be in force only when in an ACTIVE status. Scaling policies can be suspended for individual fleets. If the policy is suspended for a fleet, the policy status does not change."},"TargetConfiguration":{"Type":26,"Flags":0,"Description":"An object that contains settings for a target-based scaling policy."},"Threshold":{"Type":3,"Flags":0,"Description":"Metric value used to trigger a scaling event."},"UpdateStatus":{"Type":4,"Flags":0,"Description":"The current status of the fleet's scaling policies in a requested fleet location. The status PENDING_UPDATE indicates that an update was requested for the fleet but has not yet been completed for the location."}}}},{"2":{"Name":"ServerProcess","Properties":{"ConcurrentExecutions":{"Type":3,"Flags":1,"Description":"The number of server processes that use this configuration to run concurrently on an instance."},"LaunchPath":{"Type":4,"Flags":1,"Description":"The location of the server executable in a custom game build or the name of the Realtime script file that contains the Init() function. Game builds and Realtime scripts are installed on instances at the root:\n\nWindows (for custom game builds only): C:\\game. Example: \"C:\\game\\MyGame\\server.exe\"\n\nLinux: /local/game. Examples: \"/local/game/MyGame/server.exe\" or \"/local/game/MyRealtimeScript.js\""},"Parameters":{"Type":4,"Flags":0,"Description":"An optional list of parameters to pass to the server executable or Realtime script on launch."}}}},{"2":{"Name":"TargetConfiguration","Properties":{"TargetValue":{"Type":3,"Flags":1,"Description":"Desired value to use with a target-based scaling policy. The value must be relevant for whatever metric the scaling policy is using. For example, in a policy using the metric PercentAvailableGameSessions, the target value should be the preferred size of the fleet's buffer (the percent of capacity that should be idle and ready for new game sessions)."}}}},{"3":{"ItemType":25}},{"2":{"Name":"AWS.GameLift/FleetProperties","Properties":{"AnywhereConfiguration":{"Type":16,"Flags":0,"Description":"Configuration for Anywhere fleet."},"ApplyCapacity":{"Type":4,"Flags":0,"Description":"ComputeType to differentiate EC2 hardware managed by GameLift and Anywhere hardware managed by the customer."},"BuildId":{"Type":4,"Flags":0,"Description":"A unique identifier for a build to be deployed on the new fleet. If you are deploying the fleet with a custom game build, you must specify this property. The build must have been successfully uploaded to Amazon GameLift and be in a READY status. This fleet setting cannot be changed once the fleet is created."},"CertificateConfiguration":{"Type":17,"Flags":0,"Description":"Indicates whether to generate a TLS/SSL certificate for the new fleet. TLS certificates are used for encrypting traffic between game clients and game servers running on GameLift. If this parameter is not set, certificate generation is disabled. This fleet setting cannot be changed once the fleet is created."},"ComputeType":{"Type":4,"Flags":0,"Description":"ComputeType to differentiate EC2 hardware managed by GameLift and Anywhere hardware managed by the customer."},"Description":{"Type":4,"Flags":0,"Description":"A human-readable description of a fleet."},"DesiredEC2Instances":{"Type":3,"Flags":0,"Description":"[DEPRECATED] The number of EC2 instances that you want this fleet to host. When creating a new fleet, GameLift automatically sets this value to \"1\" and initiates a single instance. Once the fleet is active, update this value to trigger GameLift to add or remove instances from the fleet."},"EC2InboundPermissions":{"Type":29,"Flags":0,"Description":"A range of IP addresses and port settings that allow inbound traffic to connect to server processes on an Amazon GameLift server."},"EC2InstanceType":{"Type":4,"Flags":0,"Description":"The name of an EC2 instance type that is supported in Amazon GameLift. A fleet instance type determines the computing resources of each instance in the fleet, including CPU, memory, storage, and networking capacity. Amazon GameLift supports the following EC2 instance types. See Amazon EC2 Instance Types for detailed descriptions."},"FleetId":{"Type":4,"Flags":18,"Description":"Unique fleet ID"},"FleetType":{"Type":4,"Flags":0,"Description":"Indicates whether to use On-Demand instances or Spot instances for this fleet. If empty, the default is ON_DEMAND. Both categories of instances use identical hardware and configurations based on the instance type selected for this fleet."},"InstanceRoleARN":{"Type":4,"Flags":0,"Description":"A unique identifier for an AWS IAM role that manages access to your AWS services. With an instance role ARN set, any application that runs on an instance in this fleet can assume the role, including install scripts, server processes, and daemons (background processes). Create a role or look up a role's ARN from the IAM dashboard in the AWS Management Console."},"InstanceRoleCredentialsProvider":{"Type":4,"Flags":0,"Description":"Credentials provider implementation that loads credentials from the Amazon EC2 Instance Metadata Service."},"Locations":{"Type":30,"Flags":0},"LogPaths":{"Type":31,"Flags":0,"Description":"This parameter is no longer used. When hosting a custom game build, specify where Amazon GameLift should store log files using the Amazon GameLift server API call ProcessReady()"},"MaxSize":{"Type":3,"Flags":0,"Description":"[DEPRECATED] The maximum value that is allowed for the fleet's instance count. When creating a new fleet, GameLift automatically sets this value to \"1\". Once the fleet is active, you can change this value."},"MetricGroups":{"Type":32,"Flags":0,"Description":"The name of an Amazon CloudWatch metric group. A metric group aggregates the metrics for all fleets in the group. Specify a string containing the metric group name. You can use an existing name or use a new name to create a new metric group. Currently, this parameter can have only one string."},"MinSize":{"Type":3,"Flags":0,"Description":"[DEPRECATED] The minimum value allowed for the fleet's instance count. When creating a new fleet, GameLift automatically sets this value to \"0\". After the fleet is active, you can change this value."},"Name":{"Type":4,"Flags":1,"Description":"A descriptive label that is associated with a fleet. Fleet names do not need to be unique."},"NewGameSessionProtectionPolicy":{"Type":4,"Flags":0,"Description":"A game session protection policy to apply to all game sessions hosted on instances in this fleet. When protected, active game sessions cannot be terminated during a scale-down event. If this parameter is not set, instances in this fleet default to no protection. You can change a fleet's protection policy to affect future game sessions on the fleet. You can also set protection for individual game sessions."},"PeerVpcAwsAccountId":{"Type":4,"Flags":0,"Description":"A unique identifier for the AWS account with the VPC that you want to peer your Amazon GameLift fleet with. You can find your account ID in the AWS Management Console under account settings."},"PeerVpcId":{"Type":4,"Flags":0,"Description":"A unique identifier for a VPC with resources to be accessed by your Amazon GameLift fleet. The VPC must be in the same Region as your fleet. To look up a VPC ID, use the VPC Dashboard in the AWS Management Console."},"ResourceCreationLimitPolicy":{"Type":22,"Flags":0,"Description":"A policy that limits the number of game sessions an individual player can create over a span of time for this fleet."},"RuntimeConfiguration":{"Type":23,"Flags":0,"Description":"Instructions for launching server processes on each instance in the fleet. Server processes run either a custom game build executable or a Realtime script. The runtime configuration defines the server executables or launch script file, launch parameters, and the number of processes to run concurrently on each instance. When creating a fleet, the runtime configuration must have at least one server process configuration; otherwise the request fails with an invalid request exception.\n\nThis parameter is required unless the parameters ServerLaunchPath and ServerLaunchParameters are defined. Runtime configuration has replaced these parameters, but fleets that use them will continue to work."},"ScalingPolicies":{"Type":33,"Flags":0,"Description":"A list of rules that control how a fleet is scaled."},"ScriptId":{"Type":4,"Flags":0,"Description":"A unique identifier for a Realtime script to be deployed on a new Realtime Servers fleet. The script must have been successfully uploaded to Amazon GameLift. This fleet setting cannot be changed once the fleet is created.\n\nNote: It is not currently possible to use the !Ref command to reference a script created with a CloudFormation template for the fleet property ScriptId. Instead, use Fn::GetAtt Script.Arn or Fn::GetAtt Script.Id to retrieve either of these properties as input for ScriptId. Alternatively, enter a ScriptId string manually."},"ServerLaunchParameters":{"Type":4,"Flags":0,"Description":"This parameter is no longer used but is retained for backward compatibility. Instead, specify server launch parameters in the RuntimeConfiguration parameter. A request must specify either a runtime configuration or values for both ServerLaunchParameters and ServerLaunchPath."},"ServerLaunchPath":{"Type":4,"Flags":0,"Description":"This parameter is no longer used. Instead, specify a server launch path using the RuntimeConfiguration parameter. Requests that specify a server launch path and launch parameters instead of a runtime configuration will continue to work."}}}},{"3":{"ItemType":18}},{"3":{"ItemType":21}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":24}},{"2":{"Name":"AWS.GameLift/Fleet","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":28,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.GameLift/Fleet@default","ScopeType":0,"Body":34}},{"2":{"Name":"AutoScalingGroupArn"}},{"2":{"Name":"AutoScalingPolicy","Properties":{"EstimatedInstanceWarmup":{"Type":3,"Flags":0},"TargetTrackingConfiguration":{"Type":61,"Flags":1}}}},{"2":{"Name":"BalancingStrategy"}},{"2":{"Name":"CreationTime"}},{"2":{"Name":"DeleteOption"}},{"2":{"Name":"EstimatedInstanceWarmup"}},{"2":{"Name":"GameServerGroup","Properties":{"AutoScalingGroupArn":{"Type":4,"Flags":0},"BalancingStrategy":{"Type":4,"Flags":0},"CreationTime":{"Type":4,"Flags":0},"GameServerGroupArn":{"Type":4,"Flags":16},"GameServerGroupName":{"Type":4,"Flags":0},"GameServerProtectionPolicy":{"Type":4,"Flags":0},"InstanceDefinitions":{"Type":66,"Flags":0},"LastUpdatedTime":{"Type":4,"Flags":0},"RoleArn":{"Type":4,"Flags":0},"Status":{"Type":4,"Flags":0},"StatusReason":{"Type":4,"Flags":0},"SuspendedActions":{"Type":67,"Flags":0}}}},{"2":{"Name":"GameServerGroupArn"}},{"2":{"Name":"GameServerGroupName"}},{"2":{"Name":"GameServerProtectionPolicy"}},{"2":{"Name":"InstanceDefinition","Properties":{"InstanceType":{"Type":4,"Flags":1},"WeightedCapacity":{"Type":4,"Flags":0}}}},{"2":{"Name":"InstanceDefinitions"}},{"2":{"Name":"InstanceType"}},{"2":{"Name":"LastUpdatedTime"}},{"2":{"Name":"LaunchTemplate","Properties":{"LaunchTemplateId":{"Type":4,"Flags":0},"LaunchTemplateName":{"Type":4,"Flags":0},"Version":{"Type":4,"Flags":0}}}},{"2":{"Name":"LaunchTemplateId"}},{"2":{"Name":"LaunchTemplateName"}},{"2":{"Name":"MaxSize"}},{"2":{"Name":"MinSize"}},{"2":{"Name":"RoleArn"}},{"2":{"Name":"Status"}},{"2":{"Name":"StatusReason"}},{"2":{"Name":"SuspendedActions"}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":0,"Description":"The key for a developer-defined key:value pair for tagging an AWS resource."},"Value":{"Type":4,"Flags":0,"Description":"The value for a developer-defined key:value pair for tagging an AWS resource."}}}},{"2":{"Name":"Tags"}},{"2":{"Name":"TargetTrackingConfiguration","Properties":{"TargetValue":{"Type":3,"Flags":1}}}},{"2":{"Name":"TargetValue"}},{"2":{"Name":"Version"}},{"2":{"Name":"VpcSubnets"}},{"2":{"Name":"WeightedCapacity"}},{"3":{"ItemType":46}},{"3":{"ItemType":4}},{"3":{"ItemType":46}},{"3":{"ItemType":4}},{"3":{"ItemType":59}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.GameLift/GameServerGroupProperties","Properties":{"AutoScalingGroupArn":{"Type":4,"Flags":2,"Description":"A generated unique ID for the EC2 Auto Scaling group that is associated with this game server group."},"AutoScalingPolicy":{"Type":37,"Flags":4,"Description":"Configuration settings to define a scaling policy for the Auto Scaling group that is optimized for game hosting"},"BalancingStrategy":{"Type":4,"Flags":0,"Description":"The fallback balancing method to use for the game server group when Spot Instances in a Region become unavailable or are not viable for game hosting."},"DeleteOption":{"Type":4,"Flags":4,"Description":"The type of delete to perform."},"GameServerGroupArn":{"Type":4,"Flags":18,"Description":"A generated unique ID for the game server group."},"GameServerGroupName":{"Type":4,"Flags":1,"Description":"An identifier for the new game server group."},"GameServerProtectionPolicy":{"Type":4,"Flags":0,"Description":"A flag that indicates whether instances in the game server group are protected from early termination."},"InstanceDefinitions":{"Type":73,"Flags":1,"Description":"A set of EC2 instance types to use when creating instances in the group."},"LaunchTemplate":{"Type":50,"Flags":4,"Description":"The EC2 launch template that contains configuration settings and game server code to be deployed to all instances in the game server group."},"MaxSize":{"Type":3,"Flags":4,"Description":"The maximum number of instances allowed in the EC2 Auto Scaling group."},"MinSize":{"Type":3,"Flags":4,"Description":"The minimum number of instances allowed in the EC2 Auto Scaling group."},"RoleArn":{"Type":4,"Flags":1,"Description":"The Amazon Resource Name (ARN) for an IAM role that allows Amazon GameLift to access your EC2 Auto Scaling groups."},"Tags":{"Type":74,"Flags":4,"Description":"A list of labels to assign to the new game server group resource."},"VpcSubnets":{"Type":75,"Flags":4,"Description":"A list of virtual private cloud (VPC) subnets to use with instances in the game server group."}}}},{"3":{"ItemType":46}},{"3":{"ItemType":59}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.GameLift/GameServerGroup","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":72,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.GameLift/GameServerGroup@default","ScopeType":0,"Body":76}},{"2":{"Name":"AllowedLocations"}},{"2":{"Name":"FilterConfiguration","Properties":{"AllowedLocations":{"Type":87,"Flags":0}}}},{"2":{"Name":"GameSessionQueueDestination","Properties":{"DestinationArn":{"Type":4,"Flags":0}}}},{"2":{"Name":"LocationOrder"}},{"2":{"Name":"PlayerLatencyPolicy","Properties":{"MaximumIndividualPlayerLatencyMilliseconds":{"Type":3,"Flags":0,"Description":"The maximum latency value that is allowed for any player, in milliseconds. All policies must have a value set for this property."},"PolicyDurationSeconds":{"Type":3,"Flags":0,"Description":"The length of time, in seconds, that the policy is enforced while placing a new game session."}}}},{"2":{"Name":"PriorityConfiguration","Properties":{"LocationOrder":{"Type":89,"Flags":0},"PriorityOrder":{"Type":90,"Flags":0}}}},{"2":{"Name":"PriorityOrder"}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length."},"Value":{"Type":4,"Flags":1,"Description":"The value for the tag. You can specify a value that is 1 to 256 Unicode characters in length."}}}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.GameLift/GameSessionQueueProperties","Properties":{"Arn":{"Type":4,"Flags":2,"Description":"The Amazon Resource Name (ARN) that is assigned to a Amazon GameLift game session queue resource and uniquely identifies it."},"CustomEventData":{"Type":4,"Flags":0,"Description":"Information that is added to all events that are related to this game session queue."},"Destinations":{"Type":93,"Flags":0,"Description":"A list of fleets and/or fleet aliases that can be used to fulfill game session placement requests in the queue."},"FilterConfiguration":{"Type":95,"Flags":0,"Description":"A list of locations where a queue is allowed to place new game sessions."},"Name":{"Type":4,"Flags":17,"Description":"A descriptive label that is associated with game session queue. Queue names must be unique within each Region."},"NotificationTarget":{"Type":4,"Flags":0,"Description":"An SNS topic ARN that is set up to receive game session placement notifications."},"PlayerLatencyPolicies":{"Type":96,"Flags":0,"Description":"A set of policies that act as a sliding cap on player latency."},"PriorityConfiguration":{"Type":99,"Flags":0,"Description":"Custom settings to use when prioritizing destinations and locations for game session placements."},"Tags":{"Type":100,"Flags":0,"Description":"An array of key-value pairs to apply to this resource."},"TimeoutInSeconds":{"Type":3,"Flags":0,"Description":"The maximum time, in seconds, that a new game session placement request remains in the queue."}}}},{"3":{"ItemType":80}},{"3":{"ItemType":4}},{"2":{"Name":"GameSessionQueue_FilterConfiguration","Properties":{"AllowedLocations":{"Type":94,"Flags":0}}}},{"3":{"ItemType":82}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"2":{"Name":"GameSessionQueue_PriorityConfiguration","Properties":{"LocationOrder":{"Type":97,"Flags":0},"PriorityOrder":{"Type":98,"Flags":0}}}},{"3":{"ItemType":85}},{"2":{"Name":"AWS.GameLift/GameSessionQueue","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":92,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.GameLift/GameSessionQueue@default","ScopeType":0,"Body":101}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length."},"Value":{"Type":4,"Flags":1,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length."}}}},{"2":{"Name":"AWS.GameLift/LocationProperties","Properties":{"LocationArn":{"Type":4,"Flags":2},"LocationName":{"Type":4,"Flags":17},"Tags":{"Type":105,"Flags":0,"Description":"An array of key-value pairs to apply to this resource."}}}},{"3":{"ItemType":103}},{"2":{"Name":"AWS.GameLift/Location","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":104,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.GameLift/Location@default","ScopeType":0,"Body":106}},{"2":{"Name":"GameProperty","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The game property identifier."},"Value":{"Type":4,"Flags":1,"Description":"The game property value."}}}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length."},"Value":{"Type":4,"Flags":1,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length."}}}},{"2":{"Name":"AWS.GameLift/MatchmakingConfigurationProperties","Properties":{"AcceptanceRequired":{"Type":2,"Flags":1,"Description":"A flag that indicates whether a match that was created with this configuration must be accepted by the matched players"},"AcceptanceTimeoutSeconds":{"Type":3,"Flags":0,"Description":"The length of time (in seconds) to wait for players to accept a proposed match, if acceptance is required."},"AdditionalPlayerCount":{"Type":3,"Flags":0,"Description":"The number of player slots in a match to keep open for future players."},"Arn":{"Type":4,"Flags":2,"Description":"The Amazon Resource Name (ARN) that is assigned to a Amazon GameLift matchmaking configuration resource and uniquely identifies it."},"BackfillMode":{"Type":4,"Flags":0,"Description":"The method used to backfill game sessions created with this matchmaking configuration."},"CreationTime":{"Type":4,"Flags":0,"Description":"A time stamp indicating when this data object was created."},"CustomEventData":{"Type":4,"Flags":0,"Description":"Information to attach to all events related to the matchmaking configuration."},"Description":{"Type":4,"Flags":0,"Description":"A descriptive label that is associated with matchmaking configuration."},"FlexMatchMode":{"Type":4,"Flags":0,"Description":"Indicates whether this matchmaking configuration is being used with Amazon GameLift hosting or as a standalone matchmaking solution."},"GameProperties":{"Type":111,"Flags":0,"Description":"A set of custom properties for a game session, formatted as key:value pairs."},"GameSessionData":{"Type":4,"Flags":0,"Description":"A set of custom game session properties, formatted as a single string value."},"GameSessionQueueArns":{"Type":112,"Flags":0,"Description":"The Amazon Resource Name (ARN) that is assigned to a Amazon GameLift game session queue resource and uniquely identifies it."},"Name":{"Type":4,"Flags":17,"Description":"A unique identifier for the matchmaking configuration."},"NotificationTarget":{"Type":4,"Flags":0,"Description":"An SNS topic ARN that is set up to receive matchmaking notifications."},"RequestTimeoutSeconds":{"Type":3,"Flags":1,"Description":"The maximum duration, in seconds, that a matchmaking ticket can remain in process before timing out."},"RuleSetArn":{"Type":4,"Flags":0,"Description":"The Amazon Resource Name (ARN) associated with the GameLift matchmaking rule set resource that this configuration uses."},"RuleSetName":{"Type":4,"Flags":1,"Description":"A unique identifier for the matchmaking rule set to use with this configuration."},"Tags":{"Type":113,"Flags":0,"Description":"An array of key-value pairs to apply to this resource."}}}},{"3":{"ItemType":108}},{"3":{"ItemType":4}},{"3":{"ItemType":109}},{"2":{"Name":"AWS.GameLift/MatchmakingConfiguration","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":110,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.GameLift/MatchmakingConfiguration@default","ScopeType":0,"Body":114}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length."},"Value":{"Type":4,"Flags":1,"Description":"The value for the tag. You can specify a value that is 1 to 256 Unicode characters in length."}}}},{"2":{"Name":"AWS.GameLift/MatchmakingRuleSetProperties","Properties":{"Arn":{"Type":4,"Flags":2,"Description":"The Amazon Resource Name (ARN) that is assigned to a Amazon GameLift matchmaking rule set resource and uniquely identifies it."},"CreationTime":{"Type":4,"Flags":2,"Description":"A time stamp indicating when this data object was created. Format is a number expressed in Unix time as milliseconds."},"Name":{"Type":4,"Flags":17,"Description":"A unique identifier for the matchmaking rule set."},"RuleSetBody":{"Type":4,"Flags":1,"Description":"A collection of matchmaking rules, formatted as a JSON string."},"Tags":{"Type":118,"Flags":0,"Description":"An array of key-value pairs to apply to this resource."}}}},{"3":{"ItemType":116}},{"2":{"Name":"AWS.GameLift/MatchmakingRuleSet","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":117,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.GameLift/MatchmakingRuleSet@default","ScopeType":0,"Body":119}},{"2":{"Name":"S3Location","Properties":{"Bucket":{"Type":4,"Flags":1,"Description":"An Amazon S3 bucket identifier. This is the name of the S3 bucket."},"Key":{"Type":4,"Flags":1,"Description":"The name of the zip file that contains the script files."},"ObjectVersion":{"Type":4,"Flags":0,"Description":"The version of the file, if object versioning is turned on for the bucket. Amazon GameLift uses this information when retrieving files from your S3 bucket. To retrieve a specific version of the file, provide an object version. To retrieve the latest version of the file, do not set this parameter."},"RoleArn":{"Type":4,"Flags":1,"Description":"The Amazon Resource Name (ARN) for an IAM role that allows Amazon GameLift to access the S3 bucket."}}}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length."},"Value":{"Type":4,"Flags":1,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length."}}}},{"2":{"Name":"AWS.GameLift/ScriptProperties","Properties":{"Arn":{"Type":4,"Flags":2,"Description":"The Amazon Resource Name (ARN) that is assigned to a Amazon GameLift script resource and uniquely identifies it. ARNs are unique across all Regions. In a GameLift script ARN, the resource ID matches the Id value."},"CreationTime":{"Type":4,"Flags":2,"Description":"A time stamp indicating when this data object was created. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\")."},"Id":{"Type":4,"Flags":18,"Description":"A unique identifier for the Realtime script"},"Name":{"Type":4,"Flags":0,"Description":"A descriptive label that is associated with a script. Script names do not need to be unique."},"SizeOnDisk":{"Type":3,"Flags":2,"Description":"The file size of the uploaded Realtime script, expressed in bytes. When files are uploaded from an S3 location, this value remains at \"0\"."},"StorageLocation":{"Type":124,"Flags":1,"Description":"The location of the Amazon S3 bucket where a zipped file containing your Realtime scripts is stored. The storage location must specify the Amazon S3 bucket name, the zip file name (the \"key\"), and a role ARN that allows Amazon GameLift to access the Amazon S3 storage location. The S3 bucket must be in the same Region where you want to create a new script. By default, Amazon GameLift uploads the latest version of the zip file; if you have S3 object versioning turned on, you can use the ObjectVersion parameter to specify an earlier version."},"Tags":{"Type":125,"Flags":0,"Description":"An array of key-value pairs to apply to this resource."},"Version":{"Type":4,"Flags":0,"Description":"The version that is associated with a script. Version strings do not need to be unique."}}}},{"2":{"Name":"Script_S3Location","Properties":{"Bucket":{"Type":4,"Flags":1,"Description":"An Amazon S3 bucket identifier. This is the name of the S3 bucket."},"Key":{"Type":4,"Flags":1,"Description":"The name of the zip file that contains the script files."},"ObjectVersion":{"Type":4,"Flags":0,"Description":"The version of the file, if object versioning is turned on for the bucket. Amazon GameLift uses this information when retrieving files from your S3 bucket. To retrieve a specific version of the file, provide an object version. To retrieve the latest version of the file, do not set this parameter."},"RoleArn":{"Type":4,"Flags":1,"Description":"The Amazon Resource Name (ARN) for an IAM role that allows Amazon GameLift to access the S3 bucket."}}}},{"3":{"ItemType":122}},{"2":{"Name":"AWS.GameLift/Script","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":123,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.GameLift/Script@default","ScopeType":0,"Body":126}}]