[{"1":{"Kind":1}},{"1":{"Kind":2}},{"1":{"Kind":3}},{"1":{"Kind":4}},{"1":{"Kind":5}},{"1":{"Kind":6}},{"1":{"Kind":7}},{"1":{"Kind":8}},{"2":{"Name":"AppMonitorConfiguration","Properties":{"AllowCookies":{"Type":2,"Flags":0,"Description":"If you set this to true, the RUM web client sets two cookies, a session cookie and a user cookie. The cookies allow the RUM web client to collect data relating to the number of users an application has and the behavior of the application across a sequence of events. Cookies are stored in the top-level domain of the current page."},"EnableXRay":{"Type":2,"Flags":0,"Description":"If you set this to true, RUM enables xray tracing for the user sessions that RUM samples. RUM adds an xray trace header to allowed HTTP requests. It also records an xray segment for allowed HTTP requests. You can see traces and segments from these user sessions in the xray console and the CW ServiceLens console."},"ExcludedPages":{"Type":20,"Flags":0,"Description":"A list of URLs in your website or application to exclude from RUM data collection. You can't include both ExcludedPages and IncludedPages in the same operation."},"FavoritePages":{"Type":21,"Flags":0,"Description":"A list of pages in the RUM console that are to be displayed with a favorite icon."},"GuestRoleArn":{"Type":4,"Flags":0,"Description":"The ARN of the guest IAM role that is attached to the identity pool that is used to authorize the sending of data to RUM."},"IdentityPoolId":{"Type":4,"Flags":0,"Description":"The ID of the identity pool that is used to authorize the sending of data to RUM."},"IncludedPages":{"Type":22,"Flags":0,"Description":"If this app monitor is to collect data from only certain pages in your application, this structure lists those pages. You can't include both ExcludedPages and IncludedPages in the same operation."},"MetricDestinations":{"Type":23,"Flags":0,"Description":"An array of structures which define the destinations and the metrics that you want to send."},"SessionSampleRate":{"Type":3,"Flags":0,"Description":"Specifies the percentage of user sessions to use for RUM data collection. Choosing a higher percentage gives you more data but also incurs more costs. The number you specify is the percentage of user sessions that will be used. If you omit this parameter, the default of 10 is used."},"Telemetries":{"Type":24,"Flags":0,"Description":"An array that lists the types of telemetry data that this app monitor is to collect."}}}},{"2":{"Name":"Arn"}},{"2":{"Name":"CustomEvents","Properties":{"Status":{"Type":4,"Flags":0,"Description":"Indicates whether AppMonitor accepts custom events."}}}},{"2":{"Name":"CustomEventsStatus"}},{"2":{"Name":"FavoritePages"}},{"2":{"Name":"MetricDefinition","Properties":{"DimensionKeys":{"Type":26,"Flags":0,"Description":"Use this field only if you are sending the metric to CloudWatch.\n\nThis field is a map of field paths to dimension names. It defines the dimensions to associate with this metric in CloudWatch. For extended metrics, valid values for the entries in this field are the following:\n\n\"metadata.pageId\": \"PageId\"\n\n\"metadata.browserName\": \"BrowserName\"\n\n\"metadata.deviceType\": \"DeviceType\"\n\n\"metadata.osName\": \"OSName\"\n\n\"metadata.countryCode\": \"CountryCode\"\n\n\"event_details.fileType\": \"FileType\"\n\nAll dimensions listed in this field must also be included in EventPattern."},"EventPattern":{"Type":4,"Flags":0,"Description":"The pattern that defines the metric, specified as a JSON object. RUM checks events that happen in a user's session against the pattern, and events that match the pattern are sent to the metric destination.\n\nWhen you define extended metrics, the metric definition is not valid if EventPattern is omitted.\n\nExample event patterns:\n\n'{ \"event_type\": [\"com.amazon.rum.js_error_event\"], \"metadata\": { \"browserName\": [ \"Chrome\", \"Safari\" ], } }'\n\n'{ \"event_type\": [\"com.amazon.rum.performance_navigation_event\"], \"metadata\": { \"browserName\": [ \"Chrome\", \"Firefox\" ] }, \"event_details\": { \"duration\": [{ \"numeric\": [ \"<\", 2000 ] }] } }'\n\n'{ \"event_type\": [\"com.amazon.rum.performance_navigation_event\"], \"metadata\": { \"browserName\": [ \"Chrome\", \"Safari\" ], \"countryCode\": [ \"US\" ] }, \"event_details\": { \"duration\": [{ \"numeric\": [ \">=\", 2000, \"<\", 8000 ] }] } }'\n\nIf the metrics destination' is CloudWatch and the event also matches a value in DimensionKeys, then the metric is published with the specified dimensions."},"Name":{"Type":4,"Flags":17,"Description":"The name for the metric that is defined in this structure. For extended metrics, valid values are the following:\n\nPerformanceNavigationDuration\n\nPerformanceResourceDuration\n\nNavigationSatisfiedTransaction\n\nNavigationToleratedTransaction\n\nNavigationFrustratedTransaction\n\nWebVitalsCumulativeLayoutShift\n\nWebVitalsFirstInputDelay\n\nWebVitalsLargestContentfulPaint\n\nJsErrorCount\n\nHttpErrorCount\n\nSessionCount"},"Namespace":{"Type":4,"Flags":0,"Description":"The namespace used by CloudWatch Metrics for the metric that is defined in this structure"},"UnitLabel":{"Type":4,"Flags":0,"Description":"The CloudWatch metric unit to use for this metric. If you omit this field, the metric is recorded with no unit."},"ValueKey":{"Type":4,"Flags":0,"Description":"The field within the event object that the metric value is sourced from.\n\nIf you omit this field, a hardcoded value of 1 is pushed as the metric value. This is useful if you just want to count the number of events that the filter catches.\n\nIf this metric is sent to Evidently, this field will be passed to Evidently raw and Evidently will handle data extraction from the event."}}}},{"2":{"Name":"MetricDestination","Properties":{"Destination":{"Type":4,"Flags":1,"Description":"Defines the destination to send the metrics to. Valid values are CloudWatch and Evidently. If you specify Evidently, you must also specify the ARN of the Evidently experiment that is to be the destination and an IAM role that has permission to write to the experiment."},"DestinationArn":{"Type":4,"Flags":0,"Description":"Use this parameter only if Destination is Evidently. This parameter specifies the ARN of the Evidently experiment that will receive the extended metrics."},"IamRoleArn":{"Type":4,"Flags":0,"Description":"This parameter is required if Destination is Evidently. If Destination is CloudWatch, do not use this parameter.\n\nThis parameter specifies the ARN of an IAM role that RUM will assume to write to the Evidently experiment that you are sending metrics to. This role must have permission to write to that experiment."},"MetricDefinitions":{"Type":27,"Flags":0,"Description":"An array of structures which define the metrics that you want to send."}}}},{"2":{"Name":"Pages"}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "},"Value":{"Type":4,"Flags":1,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "}}}},{"2":{"Name":"TagDef"}},{"2":{"Name":"Telemetry"}},{"2":{"Name":"Url"}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":14}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"2":{"Name":"AppMonitor_DimensionKeys","Properties":{}}},{"3":{"ItemType":13}},{"3":{"ItemType":4}},{"3":{"ItemType":16}},{"2":{"Name":"AWS.RUM/AppMonitorProperties","Properties":{"AppMonitorConfiguration":{"Type":8,"Flags":0},"CustomEvents":{"Type":10,"Flags":0},"CwLogEnabled":{"Type":2,"Flags":0,"Description":"Data collected by RUM is kept by RUM for 30 days and then deleted. This parameter specifies whether RUM sends a copy of this telemetry data to CWLlong in your account. This enables you to keep the telemetry data for more than 30 days, but it does incur CWLlong charges. If you omit this parameter, the default is false"},"Domain":{"Type":4,"Flags":1,"Description":"The top-level internet domain name for which your application has administrative authority."},"Id":{"Type":4,"Flags":2,"Description":"The unique ID of the new app monitor."},"Name":{"Type":4,"Flags":17,"Description":"A name for the app monitor"},"Tags":{"Type":31,"Flags":0}}}},{"3":{"ItemType":16}},{"2":{"Name":"AWS.RUM/AppMonitor","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":30,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RUM/AppMonitor@default","ScopeType":0,"Body":32}}]