[{"1":{"Kind":1}},{"1":{"Kind":2}},{"1":{"Kind":3}},{"1":{"Kind":4}},{"1":{"Kind":5}},{"1":{"Kind":6}},{"1":{"Kind":7}},{"1":{"Kind":8}},{"2":{"Name":"Subscription","Properties":{"Endpoint":{"Type":4,"Flags":1},"Protocol":{"Type":4,"Flags":1}}}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, `_`, `.`, `/`, `=`, `+`, and `-`."},"Value":{"Type":4,"Flags":1,"Description":"The value for the tag. You can specify a value that is 0 to 256 characters in length."}}}},{"2":{"Name":"AWS.SNS/TopicProperties","Properties":{"ContentBasedDeduplication":{"Type":2,"Flags":0,"Description":"Enables content-based deduplication for FIFO topics. By default, ContentBasedDeduplication is set to false. If you create a FIFO topic and this attribute is false, you must specify a value for the MessageDeduplicationId parameter for the Publish action.\n\nWhen you set ContentBasedDeduplication to true, Amazon SNS uses a SHA-256 hash to generate the MessageDeduplicationId using the body of the message (but not the attributes of the message).\n\n(Optional) To override the generated value, you can specify a value for the the MessageDeduplicationId parameter for the Publish action.\n\n"},"DisplayName":{"Type":4,"Flags":0,"Description":"The display name to use for an Amazon SNS topic with SMS subscriptions."},"FifoTopic":{"Type":2,"Flags":0,"Description":"Set to true to create a FIFO topic."},"KmsMasterKeyId":{"Type":4,"Flags":0,"Description":"The ID of an AWS-managed customer master key (CMK) for Amazon SNS or a custom CMK. For more information, see Key Terms. For more examples, see KeyId in the AWS Key Management Service API Reference.\n\nThis property applies only to [server-side-encryption](https://docs.aws.amazon.com/sns/latest/dg/sns-server-side-encryption.html)."},"Subscription":{"Type":11,"Flags":0,"Description":"The SNS subscriptions (endpoints) for this topic."},"Tags":{"Type":12,"Flags":0},"TopicArn":{"Type":4,"Flags":2},"TopicName":{"Type":4,"Flags":0,"Description":"The name of the topic you want to create. Topic names must include only uppercase and lowercase ASCII letters, numbers, underscores, and hyphens, and must be between 1 and 256 characters long. FIFO topic names must end with .fifo.\n\nIf you don't specify a name, AWS CloudFormation generates a unique physical ID and uses that ID for the topic name. For more information, see Name Type."}}}},{"3":{"ItemType":8}},{"3":{"ItemType":9}},{"2":{"Name":"AWS.SNS/Topic","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":10,"Flags":0,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.SNS/Topic@default","ScopeType":0,"Body":13}}]