[{"1":{"Kind":1}},{"1":{"Kind":2}},{"1":{"Kind":3}},{"1":{"Kind":4}},{"1":{"Kind":5}},{"1":{"Kind":6}},{"1":{"Kind":7}},{"1":{"Kind":8}},{"2":{"Name":"ArtifactDetails","Properties":{"MaximumCount":{"Type":3,"Flags":1,"Description":"The maximum number of artifacts allowed for the action type."},"MinimumCount":{"Type":3,"Flags":1,"Description":"The minimum number of artifacts allowed for the action type."}}}},{"2":{"Name":"ConfigurationProperties","Properties":{"Description":{"Type":4,"Flags":0,"Description":"The description of the action configuration property that is displayed to users. "},"Key":{"Type":2,"Flags":1,"Description":"Whether the configuration property is a key."},"Name":{"Type":4,"Flags":1,"Description":"The name of the action configuration property."},"Queryable":{"Type":2,"Flags":0,"Description":"Indicates that the property is used with PollForJobs. When creating a custom action, an action can have up to one queryable property. If it has one, that property must be both required and not secret.If you create a pipeline with a custom action type, and that custom action contains a queryable property, the value for that configuration property is subject to other restrictions. The value must be less than or equal to twenty (20) characters. The value can contain only alphanumeric characters, underscores, and hyphens. "},"Required":{"Type":2,"Flags":1,"Description":"Whether the configuration property is a required value."},"Secret":{"Type":2,"Flags":1,"Description":"Whether the configuration property is secret. Secrets are hidden from all calls except for GetJobDetails, GetThirdPartyJobDetails, PollForJobs, and PollForThirdPartyJobs."},"Type":{"Type":4,"Flags":0,"Description":"The type of the configuration property."}}}},{"2":{"Name":"Settings","Properties":{"EntityUrlTemplate":{"Type":4,"Flags":0,"Description":"The URL returned to the AWS CodePipeline console that provides a deep link to the resources of the external system, such as the configuration page for an AWS CodeDeploy deployment group. This link is provided as part of the action display in the pipeline. "},"ExecutionUrlTemplate":{"Type":4,"Flags":0,"Description":"The URL returned to the AWS CodePipeline console that contains a link to the top-level landing page for the external system, such as the console page for AWS CodeDeploy. This link is shown on the pipeline view page in the AWS CodePipeline console and provides a link to the execution entity of the external action. "},"RevisionUrlTemplate":{"Type":4,"Flags":0,"Description":"The URL returned to the AWS CodePipeline console that contains a link to the page where customers can update or change the configuration of the external action. "},"ThirdPartyConfigurationUrl":{"Type":4,"Flags":0,"Description":"The URL of a sign-up page where users can sign up for an external service and perform initial configuration of the action provided by that service."}}}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1},"Value":{"Type":4,"Flags":1}}}},{"2":{"Name":"AWS.CodePipeline/CustomActionTypeProperties","Properties":{"Category":{"Type":4,"Flags":17,"Description":"The category of the custom action, such as a build action or a test action."},"ConfigurationProperties":{"Type":13,"Flags":4,"Description":"The configuration properties for the custom action."},"Id":{"Type":4,"Flags":2},"InputArtifactDetails":{"Type":8,"Flags":1,"Description":"The details of the input artifact for the action, such as its commit ID."},"OutputArtifactDetails":{"Type":8,"Flags":1,"Description":"The details of the output artifact of the action, such as its commit ID."},"Provider":{"Type":4,"Flags":17,"Description":"The provider of the service used in the custom action, such as AWS CodeDeploy."},"Settings":{"Type":10,"Flags":0,"Description":"URLs that provide users information about this custom action."},"Tags":{"Type":14,"Flags":0,"Description":"Any tags assigned to the custom action."},"Version":{"Type":4,"Flags":17,"Description":"The version identifier of the custom action."}}}},{"3":{"ItemType":9}},{"3":{"ItemType":11}},{"2":{"Name":"AWS.CodePipeline/CustomActionType","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":12,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.CodePipeline/CustomActionType@default","ScopeType":0,"Body":15}}]