[{"1":{"Kind":1}},{"1":{"Kind":2}},{"1":{"Kind":3}},{"1":{"Kind":4}},{"1":{"Kind":5}},{"1":{"Kind":6}},{"1":{"Kind":7}},{"1":{"Kind":8}},{"2":{"Name":"Arn"}},{"2":{"Name":"SubnetId"}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 127 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "},"Value":{"Type":4,"Flags":1,"Description":"The value for the tag. You can specify a value that is 0 to 255 Unicode characters in length. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "}}}},{"2":{"Name":"Tags"}},{"3":{"ItemType":10}},{"2":{"Name":"AWS.EMR/StudioProperties","Properties":{"Arn":{"Type":8,"Flags":2,"Description":"The Amazon Resource Name (ARN) of the EMR Studio."},"AuthMode":{"Type":4,"Flags":1,"Description":"Specifies whether the Studio authenticates users using single sign-on (SSO) or IAM. Amazon EMR Studio currently only supports SSO authentication."},"DefaultS3Location":{"Type":4,"Flags":1,"Description":"The default Amazon S3 location to back up EMR Studio Workspaces and notebook files. A Studio user can select an alternative Amazon S3 location when creating a Workspace."},"Description":{"Type":4,"Flags":0,"Description":"A detailed description of the Studio."},"EngineSecurityGroupId":{"Type":4,"Flags":1,"Description":"The ID of the Amazon EMR Studio Engine security group. The Engine security group allows inbound network traffic from the Workspace security group, and it must be in the same VPC specified by VpcId."},"IdpAuthUrl":{"Type":4,"Flags":0,"Description":"Your identity provider's authentication endpoint. Amazon EMR Studio redirects federated users to this endpoint for authentication when logging in to a Studio with the Studio URL."},"IdpRelayStateParameterName":{"Type":4,"Flags":0,"Description":"The name of relay state parameter for external Identity Provider."},"Name":{"Type":4,"Flags":1,"Description":"A descriptive name for the Amazon EMR Studio."},"ServiceRole":{"Type":8,"Flags":1,"Description":"The IAM role that will be assumed by the Amazon EMR Studio. The service role provides a way for Amazon EMR Studio to interoperate with other AWS services."},"StudioId":{"Type":4,"Flags":2,"Description":"The ID of the EMR Studio."},"SubnetIds":{"Type":14,"Flags":1,"Description":"A list of up to 5 subnet IDs to associate with the Studio. The subnets must belong to the VPC specified by VpcId. Studio users can create a Workspace in any of the specified subnets."},"Tags":{"Type":11,"Flags":0,"Description":"A list of tags to associate with the Studio. Tags are user-defined key-value pairs that consist of a required key string with a maximum of 128 characters, and an optional value string with a maximum of 256 characters."},"Url":{"Type":4,"Flags":2,"Description":"The unique Studio access URL."},"UserRole":{"Type":8,"Flags":0,"Description":"The IAM user role that will be assumed by users and groups logged in to a Studio. The permissions attached to this IAM role can be scoped down for each user or group using session policies."},"VpcId":{"Type":4,"Flags":1,"Description":"The ID of the Amazon Virtual Private Cloud (Amazon VPC) to associate with the Studio."},"WorkspaceSecurityGroupId":{"Type":4,"Flags":1,"Description":"The ID of the Amazon EMR Studio Workspace security group. The Workspace security group allows outbound network traffic to resources in the Engine security group, and it must be in the same VPC specified by VpcId."}}}},{"3":{"ItemType":9}},{"2":{"Name":"AWS.EMR/Studio","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":13,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.EMR/Studio@default","ScopeType":0,"Body":15}},{"2":{"Name":"IamPolicyArn"}},{"2":{"Name":"AWS.EMR/StudioSessionMappingProperties","Properties":{"IdentityName":{"Type":4,"Flags":1,"Description":"The name of the user or group. For more information, see UserName and DisplayName in the AWS SSO Identity Store API Reference. Either IdentityName or IdentityId must be specified."},"IdentityType":{"Type":4,"Flags":1,"Description":"Specifies whether the identity to map to the Studio is a user or a group."},"SessionPolicyArn":{"Type":17,"Flags":1,"Description":"The Amazon Resource Name (ARN) for the session policy that will be applied to the user or group. Session policies refine Studio user permissions without the need to use multiple IAM user roles."},"StudioId":{"Type":4,"Flags":1,"Description":"The ID of the Amazon EMR Studio to which the user or group will be mapped."}}}},{"2":{"Name":"AWS.EMR/StudioSessionMapping","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":18,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.EMR/StudioSessionMapping@default","ScopeType":0,"Body":19}}]