[{"1":{"Kind":1}},{"1":{"Kind":2}},{"1":{"Kind":3}},{"1":{"Kind":4}},{"1":{"Kind":5}},{"1":{"Kind":6}},{"1":{"Kind":7}},{"1":{"Kind":8}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":0,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "},"Value":{"Type":4,"Flags":0,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "}}}},{"2":{"Name":"AWS.CodeStarConnections/ConnectionProperties","Properties":{"ConnectionArn":{"Type":4,"Flags":2,"Description":"The Amazon Resource Name (ARN) of the  connection. The ARN is used as the connection reference when the connection is shared between AWS services."},"ConnectionName":{"Type":4,"Flags":0,"Description":"The name of the connection. Connection names must be unique in an AWS user account."},"ConnectionStatus":{"Type":4,"Flags":2,"Description":"The current status of the connection."},"HostArn":{"Type":4,"Flags":0,"Description":"The host arn configured to represent the infrastructure where your third-party provider is installed. You must specify either a ProviderType or a HostArn."},"OwnerAccountId":{"Type":4,"Flags":2,"Description":"The name of the external provider where your third-party code repository is configured. For Bitbucket, this is the account ID of the owner of the Bitbucket repository."},"ProviderType":{"Type":4,"Flags":0,"Description":"The name of the external provider where your third-party code repository is configured. You must specify either a ProviderType or a HostArn."},"Tags":{"Type":10,"Flags":0,"Description":"Specifies the tags applied to a connection."}}}},{"3":{"ItemType":8}},{"2":{"Name":"AWS.CodeStarConnections/Connection","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":9,"Flags":0,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.CodeStarConnections/Connection@default","ScopeType":0,"Body":11}}]