[{"1":{"Kind":1}},{"1":{"Kind":2}},{"1":{"Kind":3}},{"1":{"Kind":4}},{"1":{"Kind":5}},{"1":{"Kind":6}},{"1":{"Kind":7}},{"1":{"Kind":8}},{"2":{"Name":"ScalableTargetAction","Properties":{"MaxCapacity":{"Type":3,"Flags":0},"MinCapacity":{"Type":3,"Flags":0}}}},{"2":{"Name":"ScheduledAction","Properties":{"EndTime":{"Type":4,"Flags":0},"ScalableTargetAction":{"Type":8,"Flags":0},"Schedule":{"Type":4,"Flags":1},"ScheduledActionName":{"Type":4,"Flags":1},"StartTime":{"Type":4,"Flags":0},"Timezone":{"Type":4,"Flags":0}}}},{"2":{"Name":"SuspendedState","Properties":{"DynamicScalingInSuspended":{"Type":2,"Flags":0},"DynamicScalingOutSuspended":{"Type":2,"Flags":0},"ScheduledScalingSuspended":{"Type":2,"Flags":0}}}},{"2":{"Name":"AWS.ApplicationAutoScaling/ScalableTargetProperties","Properties":{"Id":{"Type":4,"Flags":2,"Description":"This value can be returned by using the Ref function. Ref returns the Cloudformation generated ID of the resource in format - ResourceId|ScalableDimension|ServiceNamespace"},"MaxCapacity":{"Type":3,"Flags":1,"Description":"The maximum value that you plan to scale in to. When a scaling policy is in effect, Application Auto Scaling can scale in (contract) as needed to the minimum capacity limit in response to changing demand"},"MinCapacity":{"Type":3,"Flags":1,"Description":"The minimum value that you plan to scale in to. When a scaling policy is in effect, Application Auto Scaling can scale in (contract) as needed to the minimum capacity limit in response to changing demand"},"ResourceId":{"Type":4,"Flags":17,"Description":"The identifier of the resource associated with the scalable target"},"RoleARN":{"Type":4,"Flags":4,"Description":"Specify the Amazon Resource Name (ARN) of an Identity and Access Management (IAM) role that allows Application Auto Scaling to modify the scalable target on your behalf. "},"ScalableDimension":{"Type":4,"Flags":17,"Description":"The scalable dimension associated with the scalable target. This string consists of the service namespace, resource type, and scaling property"},"ScheduledActions":{"Type":12,"Flags":0,"Description":"The scheduled actions for the scalable target. Duplicates aren't allowed."},"ServiceNamespace":{"Type":4,"Flags":17,"Description":"The namespace of the AWS service that provides the resource, or a custom-resource"},"SuspendedState":{"Type":10,"Flags":0,"Description":"An embedded object that contains attributes and attribute values that are used to suspend and resume automatic scaling. Setting the value of an attribute to true suspends the specified scaling activities. Setting it to false (default) resumes the specified scaling activities."}}}},{"3":{"ItemType":9}},{"2":{"Name":"AWS.ApplicationAutoScaling/ScalableTarget","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":11,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.ApplicationAutoScaling/ScalableTarget@default","ScopeType":0,"Body":13}},{"2":{"Name":"CustomizedMetricSpecification","Properties":{"Dimensions":{"Type":25,"Flags":0,"Description":"The dimensions of the metric."},"MetricName":{"Type":4,"Flags":0,"Description":"The name of the metric. To get the exact metric name, namespace, and dimensions, inspect the Metric object that is returned by a call to ListMetrics."},"Metrics":{"Type":26,"Flags":0,"Description":"The metrics to include in the target tracking scaling policy, as a metric data query. This can include both raw metric and metric math expressions."},"Namespace":{"Type":4,"Flags":0,"Description":"The namespace of the metric."},"Statistic":{"Type":4,"Flags":0,"Description":"The statistic of the metric."},"Unit":{"Type":4,"Flags":0,"Description":"The unit of the metric. For a complete list of the units that CloudWatch supports, see the MetricDatum data type in the Amazon CloudWatch API Reference."}}}},{"2":{"Name":"MetricDimension","Properties":{"Name":{"Type":4,"Flags":1,"Description":"The name of the dimension."},"Value":{"Type":4,"Flags":1,"Description":"The value of the dimension."}}}},{"2":{"Name":"PredefinedMetricSpecification","Properties":{"PredefinedMetricType":{"Type":4,"Flags":1,"Description":"The metric type. The ALBRequestCountPerTarget metric type applies only to Spot Fleets and ECS services."},"ResourceLabel":{"Type":4,"Flags":4,"Description":"Identifies the resource associated with the metric type. You can't specify a resource label unless the metric type is ALBRequestCountPerTarget and there is a target group attached to the Spot Fleet or ECS service."}}}},{"2":{"Name":"StepAdjustment","Properties":{"MetricIntervalLowerBound":{"Type":3,"Flags":0,"Description":"The lower bound for the difference between the alarm threshold and the CloudWatch metric. If the metric value is above the breach threshold, the lower bound is inclusive (the metric must be greater than or equal to the threshold plus the lower bound). Otherwise, it is exclusive (the metric must be greater than the threshold plus the lower bound). A null value indicates negative infinity."},"MetricIntervalUpperBound":{"Type":3,"Flags":0,"Description":"The upper bound for the difference between the alarm threshold and the CloudWatch metric. If the metric value is above the breach threshold, the upper bound is exclusive (the metric must be less than the threshold plus the upper bound). Otherwise, it is inclusive (the metric must be less than or equal to the threshold plus the upper bound). A null value indicates positive infinity."},"ScalingAdjustment":{"Type":3,"Flags":1,"Description":"The amount by which to scale, based on the specified adjustment type. A positive value adds to the current capacity while a negative number removes from the current capacity. For exact capacity, you must specify a positive value."}}}},{"2":{"Name":"StepScalingPolicyConfiguration","Properties":{"AdjustmentType":{"Type":4,"Flags":0,"Description":"Specifies how the ScalingAdjustment value in a StepAdjustment is interpreted."},"Cooldown":{"Type":3,"Flags":0,"Description":"The amount of time, in seconds, to wait for a previous scaling activity to take effect."},"MetricAggregationType":{"Type":4,"Flags":0,"Description":"The aggregation type for the CloudWatch metrics. Valid values are Minimum, Maximum, and Average. If the aggregation type is null, the value is treated as Average"},"MinAdjustmentMagnitude":{"Type":3,"Flags":0,"Description":"The minimum value to scale by when the adjustment type is PercentChangeInCapacity."},"StepAdjustments":{"Type":27,"Flags":0,"Description":"A set of adjustments that enable you to scale based on the size of the alarm breach."}}}},{"2":{"Name":"TargetTrackingMetric","Properties":{"Dimensions":{"Type":28,"Flags":0,"Description":"The dimensions for the metric."},"MetricName":{"Type":4,"Flags":0,"Description":"The name of the metric."},"Namespace":{"Type":4,"Flags":0,"Description":"The namespace of the metric."}}}},{"2":{"Name":"TargetTrackingMetricDataQuery","Properties":{"Expression":{"Type":4,"Flags":0,"Description":"The math expression to perform on the returned data, if this object is performing a math expression."},"Id":{"Type":4,"Flags":0,"Description":"A short name that identifies the object's results in the response."},"Label":{"Type":4,"Flags":0,"Description":"A human-readable label for this metric or expression. This is especially useful if this is a math expression, so that you know what the value represents."},"MetricStat":{"Type":23,"Flags":0,"Description":"Information about the metric data to return."},"ReturnData":{"Type":2,"Flags":0,"Description":"Indicates whether to return the timestamps and raw data values of this metric."}}}},{"2":{"Name":"TargetTrackingMetricDimension","Properties":{"Name":{"Type":4,"Flags":0,"Description":"The name of the dimension."},"Value":{"Type":4,"Flags":0,"Description":"The value of the dimension."}}}},{"2":{"Name":"TargetTrackingMetricStat","Properties":{"Metric":{"Type":20,"Flags":0,"Description":"The CloudWatch metric to return, including the metric name, namespace, and dimensions. "},"Stat":{"Type":4,"Flags":0,"Description":"The statistic to return. It can include any CloudWatch statistic or extended statistic."},"Unit":{"Type":4,"Flags":0,"Description":"The unit to use for the returned data points."}}}},{"2":{"Name":"TargetTrackingScalingPolicyConfiguration","Properties":{"CustomizedMetricSpecification":{"Type":15,"Flags":0,"Description":"A customized metric. You can specify either a predefined metric or a customized metric."},"DisableScaleIn":{"Type":2,"Flags":0,"Description":"Indicates whether scale in by the target tracking scaling policy is disabled. If the value is true, scale in is disabled and the target tracking scaling policy won't remove capacity from the scalable target. Otherwise, scale in is enabled and the target tracking scaling policy can remove capacity from the scalable target. The default value is false."},"PredefinedMetricSpecification":{"Type":17,"Flags":0,"Description":"A predefined metric. You can specify either a predefined metric or a customized metric."},"ScaleInCooldown":{"Type":3,"Flags":0,"Description":"The amount of time, in seconds, after a scale-in activity completes before another scale-in activity can start."},"ScaleOutCooldown":{"Type":3,"Flags":0,"Description":"The amount of time, in seconds, to wait for a previous scale-out activity to take effect."},"TargetValue":{"Type":3,"Flags":1,"Description":"The target value for the metric. Although this property accepts numbers of type Double, it won't accept values that are either too small or too large. Values must be in the range of -2^360 to 2^360. The value must be a valid number based on the choice of metric. For example, if the metric is CPU utilization, then the target value is a percent value that represents how much of the CPU can be used before scaling out."}}}},{"3":{"ItemType":16}},{"3":{"ItemType":21}},{"3":{"ItemType":18}},{"3":{"ItemType":22}},{"2":{"Name":"AWS.ApplicationAutoScaling/ScalingPolicyProperties","Properties":{"Arn":{"Type":4,"Flags":18,"Description":"ARN is a read only property for the resource."},"PolicyName":{"Type":4,"Flags":1,"Description":"The name of the scaling policy.\n\nUpdates to the name of a target tracking scaling policy are not supported, unless you also update the metric used for scaling. To change only a target tracking scaling policy's name, first delete the policy by removing the existing AWS::ApplicationAutoScaling::ScalingPolicy resource from the template and updating the stack. Then, recreate the resource with the same settings and a different name."},"PolicyType":{"Type":4,"Flags":1,"Description":"The scaling policy type.\n\nThe following policy types are supported:\n\nTargetTrackingScaling Not supported for Amazon EMR\n\nStepScaling Not supported for DynamoDB, Amazon Comprehend, Lambda, Amazon Keyspaces, Amazon MSK, Amazon ElastiCache, or Neptune."},"ResourceId":{"Type":4,"Flags":0,"Description":"The identifier of the resource associated with the scaling policy. This string consists of the resource type and unique identifier."},"ScalableDimension":{"Type":4,"Flags":16,"Description":"The scalable dimension. This string consists of the service namespace, resource type, and scaling property."},"ScalingTargetId":{"Type":4,"Flags":4,"Description":"The CloudFormation-generated ID of an Application Auto Scaling scalable target. For more information about the ID, see the Return Value section of the AWS::ApplicationAutoScaling::ScalableTarget resource."},"ServiceNamespace":{"Type":4,"Flags":0,"Description":"The namespace of the AWS service that provides the resource, or a custom-resource."},"StepScalingPolicyConfiguration":{"Type":19,"Flags":0,"Description":"A step scaling policy."},"TargetTrackingScalingPolicyConfiguration":{"Type":24,"Flags":0,"Description":"A target tracking scaling policy."}}}},{"2":{"Name":"AWS.ApplicationAutoScaling/ScalingPolicy","Properties":{"name":{"Type":4,"Flags":0,"Description":"the resource name"},"alias":{"Type":4,"Flags":1,"Description":"the resource alias"},"properties":{"Type":29,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.ApplicationAutoScaling/ScalingPolicy@default","ScopeType":0,"Body":30}}]