[{"1":{"Kind":1}},{"1":{"Kind":2}},{"1":{"Kind":3}},{"1":{"Kind":4}},{"1":{"Kind":5}},{"1":{"Kind":6}},{"1":{"Kind":7}},{"1":{"Kind":8}},{"2":{"Name":"AdvancedEventSelector","Properties":{"FieldSelectors":{"Type":12,"Flags":1,"Description":"Contains all selector statements in an advanced event selector."},"Name":{"Type":4,"Flags":0,"Description":"An optional, descriptive name for an advanced event selector, such as \"Log data events for only two S3 buckets\"."}}}},{"2":{"Name":"AdvancedFieldSelector","Properties":{"EndsWith":{"Type":13,"Flags":0,"Description":"An operator that includes events that match the last few characters of the event record field specified as the value of Field."},"Equals":{"Type":14,"Flags":0,"Description":"An operator that includes events that match the exact value of the event record field specified as the value of Field. This is the only valid operator that you can use with the readOnly, eventCategory, and resources.type fields."},"Field":{"Type":4,"Flags":1,"Description":"A field in an event record on which to filter events to be logged. Supported fields include readOnly, eventCategory, eventSource (for management events), eventName, resources.type, and resources.ARN."},"NotEndsWith":{"Type":15,"Flags":0,"Description":"An operator that excludes events that match the last few characters of the event record field specified as the value of Field."},"NotEquals":{"Type":16,"Flags":0,"Description":"An operator that excludes events that match the exact value of the event record field specified as the value of Field."},"NotStartsWith":{"Type":17,"Flags":0,"Description":"An operator that excludes events that match the first few characters of the event record field specified as the value of Field."},"StartsWith":{"Type":18,"Flags":0,"Description":"An operator that includes events that match the first few characters of the event record field specified as the value of Field."}}}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 127 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -."},"Value":{"Type":4,"Flags":1,"Description":"The value for the tag. You can specify a value that is 1 to 255 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -."}}}},{"2":{"Name":"Timestamp"}},{"3":{"ItemType":9}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.CloudTrail/EventDataStoreProperties","Properties":{"AdvancedEventSelectors":{"Type":20,"Flags":0,"Description":"The advanced event selectors that were used to select events for the data store."},"CreatedTimestamp":{"Type":11,"Flags":2,"Description":"The timestamp of the event data store's creation."},"EventDataStoreArn":{"Type":4,"Flags":2,"Description":"The ARN of the event data store."},"MultiRegionEnabled":{"Type":2,"Flags":0,"Description":"Indicates whether the event data store includes events from all regions, or only from the region in which it was created."},"Name":{"Type":4,"Flags":0,"Description":"The name of the event data store."},"OrganizationEnabled":{"Type":2,"Flags":0,"Description":"Indicates that an event data store is collecting logged events for an organization."},"RetentionPeriod":{"Type":3,"Flags":0,"Description":"The retention period, in days."},"Status":{"Type":4,"Flags":2,"Description":"The status of an event data store. Values are ENABLED and PENDING_DELETION."},"Tags":{"Type":21,"Flags":0},"TerminationProtectionEnabled":{"Type":2,"Flags":0,"Description":"Indicates whether the event data store is protected from termination."},"UpdatedTimestamp":{"Type":11,"Flags":2,"Description":"The timestamp showing when an event data store was updated, if applicable. UpdatedTimestamp is always either the same or newer than the time shown in CreatedTimestamp."}}}},{"3":{"ItemType":8}},{"3":{"ItemType":10}},{"2":{"Name":"AWS.CloudTrail/EventDataStore","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":19,"Flags":0,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.CloudTrail/EventDataStore@default","ScopeType":0,"Body":22}},{"2":{"Name":"DataResource","Properties":{"Type":{"Type":4,"Flags":1,"Description":"The resource type in which you want to log data events. You can specify AWS::S3::Object or AWS::Lambda::Function resources."},"Values":{"Type":28,"Flags":0,"Description":"An array of Amazon Resource Name (ARN) strings or partial ARN strings for the specified objects."}}}},{"2":{"Name":"EventSelector","Properties":{"DataResources":{"Type":29,"Flags":0},"ExcludeManagementEventSources":{"Type":30,"Flags":0,"Description":"An optional list of service event sources from which you do not want management events to be logged on your trail. In this release, the list can be empty (disables the filter), or it can filter out AWS Key Management Service events by containing \"kms.amazonaws.com\". By default, ExcludeManagementEventSources is empty, and AWS KMS events are included in events that are logged to your trail."},"IncludeManagementEvents":{"Type":2,"Flags":0,"Description":"Specify if you want your event selector to include management events for your trail."},"ReadWriteType":{"Type":4,"Flags":0,"Description":"Specify if you want your trail to log read-only events, write-only events, or all. For example, the EC2 GetConsoleOutput is a read-only API operation and RunInstances is a write-only API operation."}}}},{"2":{"Name":"InsightSelector","Properties":{"InsightType":{"Type":4,"Flags":0,"Description":"The type of insight to log on a trail."}}}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 127 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -."},"Value":{"Type":4,"Flags":1,"Description":"The value for the tag. You can specify a value that is 1 to 255 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -."}}}},{"3":{"ItemType":4}},{"3":{"ItemType":24}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.CloudTrail/TrailProperties","Properties":{"Arn":{"Type":4,"Flags":2},"CloudWatchLogsLogGroupArn":{"Type":4,"Flags":0,"Description":"Specifies a log group name using an Amazon Resource Name (ARN), a unique identifier that represents the log group to which CloudTrail logs will be delivered. Not required unless you specify CloudWatchLogsRoleArn."},"CloudWatchLogsRoleArn":{"Type":4,"Flags":0,"Description":"Specifies the role for the CloudWatch Logs endpoint to assume to write to a user's log group."},"EnableLogFileValidation":{"Type":2,"Flags":0,"Description":"Specifies whether log file validation is enabled. The default is false."},"EventSelectors":{"Type":32,"Flags":0,"Description":"Use event selectors to further specify the management and data event settings for your trail. By default, trails created without specific event selectors will be configured to log all read and write management events, and no data events. When an event occurs in your account, CloudTrail evaluates the event selector for all trails. For each trail, if the event matches any event selector, the trail processes and logs the event. If the event doesn't match any event selector, the trail doesn't log the event. You can configure up to five event selectors for a trail."},"IncludeGlobalServiceEvents":{"Type":2,"Flags":0,"Description":"Specifies whether the trail is publishing events from global services such as IAM to the log files."},"InsightSelectors":{"Type":33,"Flags":0,"Description":"Lets you enable Insights event logging by specifying the Insights selectors that you want to enable on an existing trail."},"IsLogging":{"Type":2,"Flags":1,"Description":"Whether the CloudTrail is currently logging AWS API calls."},"IsMultiRegionTrail":{"Type":2,"Flags":0,"Description":"Specifies whether the trail applies only to the current region or to all regions. The default is false. If the trail exists only in the current region and this value is set to true, shadow trails (replications of the trail) will be created in the other regions. If the trail exists in all regions and this value is set to false, the trail will remain in the region where it was created, and its shadow trails in other regions will be deleted. As a best practice, consider using trails that log events in all regions."},"IsOrganizationTrail":{"Type":2,"Flags":0,"Description":"Specifies whether the trail is created for all accounts in an organization in AWS Organizations, or only for the current AWS account. The default is false, and cannot be true unless the call is made on behalf of an AWS account that is the master account for an organization in AWS Organizations."},"KMSKeyId":{"Type":4,"Flags":0,"Description":"Specifies the KMS key ID to use to encrypt the logs delivered by CloudTrail. The value can be an alias name prefixed by 'alias/', a fully specified ARN to an alias, a fully specified ARN to a key, or a globally unique identifier."},"S3BucketName":{"Type":4,"Flags":1,"Description":"Specifies the name of the Amazon S3 bucket designated for publishing log files. See Amazon S3 Bucket Naming Requirements."},"S3KeyPrefix":{"Type":4,"Flags":0,"Description":"Specifies the Amazon S3 key prefix that comes after the name of the bucket you have designated for log file delivery. For more information, see Finding Your CloudTrail Log Files. The maximum length is 200 characters."},"SnsTopicArn":{"Type":4,"Flags":2},"SnsTopicName":{"Type":4,"Flags":0,"Description":"Specifies the name of the Amazon SNS topic defined for notification of log file delivery. The maximum length is 256 characters."},"Tags":{"Type":34,"Flags":0},"TrailName":{"Type":4,"Flags":0}}}},{"3":{"ItemType":25}},{"3":{"ItemType":26}},{"3":{"ItemType":27}},{"2":{"Name":"AWS.CloudTrail/Trail","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":31,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.CloudTrail/Trail@default","ScopeType":0,"Body":35}}]