[{"1":{"Kind":1}},{"1":{"Kind":2}},{"1":{"Kind":3}},{"1":{"Kind":4}},{"1":{"Kind":5}},{"1":{"Kind":6}},{"1":{"Kind":7}},{"1":{"Kind":8}},{"2":{"Name":"DBClusterRole","Properties":{"FeatureName":{"Type":4,"Flags":0,"Description":"The name of the feature associated with the AWS Identity and Access Management (IAM) role. For the list of supported feature names, see DBEngineVersion in the Amazon RDS API Reference."},"RoleArn":{"Type":4,"Flags":1,"Description":"The Amazon Resource Name (ARN) of the IAM role that is associated with the DB cluster."}}}},{"2":{"Name":"Endpoint","Properties":{"Address":{"Type":4,"Flags":2,"Description":"The connection endpoint for the DB cluster."},"Port":{"Type":4,"Flags":2,"Description":"The port number that will accept connections on this DB cluster."}}}},{"2":{"Name":"ReadEndpoint","Properties":{"Address":{"Type":4,"Flags":2,"Description":"The reader endpoint for the DB cluster."}}}},{"2":{"Name":"ScalingConfiguration","Properties":{"AutoPause":{"Type":2,"Flags":0,"Description":"A value that indicates whether to allow or disallow automatic pause for an Aurora DB cluster in serverless DB engine mode. A DB cluster can be paused only when it's idle (it has no connections)."},"MaxCapacity":{"Type":3,"Flags":0,"Description":"The maximum capacity for an Aurora DB cluster in serverless DB engine mode.\nFor Aurora MySQL, valid capacity values are 1, 2, 4, 8, 16, 32, 64, 128, and 256.\nFor Aurora PostgreSQL, valid capacity values are 2, 4, 8, 16, 32, 64, 192, and 384.\nThe maximum capacity must be greater than or equal to the minimum capacity."},"MinCapacity":{"Type":3,"Flags":0,"Description":"The minimum capacity for an Aurora DB cluster in serverless DB engine mode.\nFor Aurora MySQL, valid capacity values are 1, 2, 4, 8, 16, 32, 64, 128, and 256.\nFor Aurora PostgreSQL, valid capacity values are 2, 4, 8, 16, 32, 64, 192, and 384.\nThe minimum capacity must be less than or equal to the maximum capacity."},"SecondsUntilAutoPause":{"Type":3,"Flags":0,"Description":"The time, in seconds, before an Aurora DB cluster in serverless mode is paused."}}}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "},"Value":{"Type":4,"Flags":0,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "}}}},{"2":{"Name":"AWS.RDS/DBClusterProperties","Properties":{"AllocatedStorage":{"Type":3,"Flags":0,"Description":"The amount of storage in gibibytes (GiB) to allocate to each DB instance in the Multi-AZ DB cluster."},"AssociatedRoles":{"Type":14,"Flags":0,"Description":"Provides a list of the AWS Identity and Access Management (IAM) roles that are associated with the DB cluster. IAM roles that are associated with a DB cluster grant permission for the DB cluster to access other AWS services on your behalf."},"AutoMinorVersionUpgrade":{"Type":2,"Flags":0,"Description":"A value that indicates whether minor engine upgrades are applied automatically to the DB cluster during the maintenance window. By default, minor engine upgrades are applied automatically."},"AvailabilityZones":{"Type":15,"Flags":0,"Description":"A list of Availability Zones (AZs) where instances in the DB cluster can be created. For information on AWS Regions and Availability Zones, see Choosing the Regions and Availability Zones in the Amazon Aurora User Guide."},"BacktrackWindow":{"Type":3,"Flags":0,"Description":"The target backtrack window, in seconds. To disable backtracking, set this value to 0."},"BackupRetentionPeriod":{"Type":3,"Flags":0,"Description":"The number of days for which automated backups are retained."},"CopyTagsToSnapshot":{"Type":2,"Flags":0,"Description":"A value that indicates whether to copy all tags from the DB cluster to snapshots of the DB cluster. The default is not to copy them."},"DBClusterIdentifier":{"Type":4,"Flags":0,"Description":"The DB cluster identifier. This parameter is stored as a lowercase string."},"DBClusterInstanceClass":{"Type":4,"Flags":0,"Description":"The compute and memory capacity of each DB instance in the Multi-AZ DB cluster, for example db.m6g.xlarge."},"DBClusterParameterGroupName":{"Type":4,"Flags":0,"Description":"The name of the DB cluster parameter group to associate with this DB cluster."},"DBSubnetGroupName":{"Type":4,"Flags":0,"Description":"A DB subnet group that you want to associate with this DB cluster."},"DatabaseName":{"Type":4,"Flags":0,"Description":"The name of your database. If you don't provide a name, then Amazon RDS won't create a database in this DB cluster. For naming constraints, see Naming Constraints in the Amazon RDS User Guide."},"DeletionProtection":{"Type":2,"Flags":0,"Description":"A value that indicates whether the DB cluster has deletion protection enabled. The database can't be deleted when deletion protection is enabled. By default, deletion protection is disabled."},"EnableCloudwatchLogsExports":{"Type":16,"Flags":0,"Description":"The list of log types that need to be enabled for exporting to CloudWatch Logs. The values in the list depend on the DB engine being used. For more information, see Publishing Database Logs to Amazon CloudWatch Logs in the Amazon Aurora User Guide."},"EnableHttpEndpoint":{"Type":2,"Flags":0,"Description":"A value that indicates whether to enable the HTTP endpoint for an Aurora Serverless DB cluster. By default, the HTTP endpoint is disabled."},"EnableIAMDatabaseAuthentication":{"Type":2,"Flags":0,"Description":"A value that indicates whether to enable mapping of AWS Identity and Access Management (IAM) accounts to database accounts. By default, mapping is disabled."},"Endpoint":{"Type":9,"Flags":2},"Engine":{"Type":4,"Flags":0,"Description":"The name of the database engine to be used for this DB cluster. Valid Values: aurora (for MySQL 5.6-compatible Aurora), aurora-mysql (for MySQL 5.7-compatible Aurora), and aurora-postgresql"},"EngineMode":{"Type":4,"Flags":0,"Description":"The DB engine mode of the DB cluster, either provisioned, serverless, parallelquery, global, or multimaster."},"EngineVersion":{"Type":4,"Flags":0,"Description":"The version number of the database engine to use."},"GlobalClusterIdentifier":{"Type":4,"Flags":0,"Description":"If you are configuring an Aurora global database cluster and want your Aurora DB cluster to be a secondary member in the global database cluster, specify the global cluster ID of the global database cluster. To define the primary database cluster of the global cluster, use the AWS::RDS::GlobalCluster resource.\n\nIf you aren't configuring a global database cluster, don't specify this property."},"Iops":{"Type":3,"Flags":0,"Description":"The amount of Provisioned IOPS (input/output operations per second) to be initially allocated for each DB instance in the Multi-AZ DB cluster."},"KmsKeyId":{"Type":4,"Flags":0,"Description":"The Amazon Resource Name (ARN) of the AWS Key Management Service master key that is used to encrypt the database instances in the DB cluster, such as arn:aws:kms:us-east-1:012345678910:key/abcd1234-a123-456a-a12b-a123b4cd56ef. If you enable the StorageEncrypted property but don't specify this property, the default master key is used. If you specify this property, you must set the StorageEncrypted property to true."},"MasterUserPassword":{"Type":4,"Flags":4,"Description":"The master password for the DB instance."},"MasterUsername":{"Type":4,"Flags":0,"Description":"The name of the master user for the DB cluster. You must specify MasterUsername, unless you specify SnapshotIdentifier. In that case, don't specify MasterUsername."},"MonitoringInterval":{"Type":3,"Flags":0,"Description":"The interval, in seconds, between points when Enhanced Monitoring metrics are collected for the DB cluster. To turn off collecting Enhanced Monitoring metrics, specify 0. The default is 0."},"MonitoringRoleArn":{"Type":4,"Flags":0,"Description":"The Amazon Resource Name (ARN) for the IAM role that permits RDS to send Enhanced Monitoring metrics to Amazon CloudWatch Logs."},"PerformanceInsightsEnabled":{"Type":2,"Flags":0,"Description":"A value that indicates whether to turn on Performance Insights for the DB cluster."},"PerformanceInsightsKmsKeyId":{"Type":4,"Flags":0,"Description":"The Amazon Web Services KMS key identifier for encryption of Performance Insights data."},"PerformanceInsightsRetentionPeriod":{"Type":3,"Flags":0,"Description":"The amount of time, in days, to retain Performance Insights data."},"Port":{"Type":3,"Flags":0,"Description":"The port number on which the instances in the DB cluster accept connections. Default: 3306 if engine is set as aurora or 5432 if set to aurora-postgresql."},"PreferredBackupWindow":{"Type":4,"Flags":0,"Description":"The daily time range during which automated backups are created if automated backups are enabled using the BackupRetentionPeriod parameter. The default is a 30-minute window selected at random from an 8-hour block of time for each AWS Region. To see the time blocks available, see Adjusting the Preferred DB Cluster Maintenance Window in the Amazon Aurora User Guide."},"PreferredMaintenanceWindow":{"Type":4,"Flags":0,"Description":"The weekly time range during which system maintenance can occur, in Universal Coordinated Time (UTC). The default is a 30-minute window selected at random from an 8-hour block of time for each AWS Region, occurring on a random day of the week. To see the time blocks available, see Adjusting the Preferred DB Cluster Maintenance Window in the Amazon Aurora User Guide."},"PubliclyAccessible":{"Type":2,"Flags":0,"Description":"A value that indicates whether the DB cluster is publicly accessible."},"ReadEndpoint":{"Type":10,"Flags":0},"ReplicationSourceIdentifier":{"Type":4,"Flags":0,"Description":"The Amazon Resource Name (ARN) of the source DB instance or DB cluster if this DB cluster is created as a Read Replica."},"RestoreType":{"Type":4,"Flags":4,"Description":"The type of restore to be performed. You can specify one of the following values:\nfull-copy - The new DB cluster is restored as a full copy of the source DB cluster.\ncopy-on-write - The new DB cluster is restored as a clone of the source DB cluster."},"ScalingConfiguration":{"Type":11,"Flags":0,"Description":"The ScalingConfiguration property type specifies the scaling configuration of an Aurora Serverless DB cluster."},"SnapshotIdentifier":{"Type":4,"Flags":4,"Description":"The identifier for the DB snapshot or DB cluster snapshot to restore from.\nYou can use either the name or the Amazon Resource Name (ARN) to specify a DB cluster snapshot. However, you can use only the ARN to specify a DB snapshot.\nAfter you restore a DB cluster with a SnapshotIdentifier property, you must specify the same SnapshotIdentifier property for any future updates to the DB cluster. When you specify this property for an update, the DB cluster is not restored from the snapshot again, and the data in the database is not changed. However, if you don't specify the SnapshotIdentifier property, an empty DB cluster is created, and the original DB cluster is deleted. If you specify a property that is different from the previous snapshot restore property, the DB cluster is restored from the specified SnapshotIdentifier property, and the original DB cluster is deleted."},"SourceDBClusterIdentifier":{"Type":4,"Flags":4,"Description":"The identifier of the source DB cluster from which to restore."},"SourceRegion":{"Type":4,"Flags":4,"Description":"The AWS Region which contains the source DB cluster when replicating a DB cluster. For example, us-east-1."},"StorageEncrypted":{"Type":2,"Flags":0,"Description":"Indicates whether the DB instance is encrypted.\nIf you specify the DBClusterIdentifier, SnapshotIdentifier, or SourceDBInstanceIdentifier property, don't specify this property. The value is inherited from the cluster, snapshot, or source DB instance."},"StorageType":{"Type":4,"Flags":0,"Description":"Specifies the storage type to be associated with the DB cluster."},"Tags":{"Type":17,"Flags":0,"Description":"An array of key-value pairs to apply to this resource."},"UseLatestRestorableTime":{"Type":2,"Flags":4,"Description":"A value that indicates whether to restore the DB cluster to the latest restorable backup time. By default, the DB cluster is not restored to the latest restorable backup time."},"VpcSecurityGroupIds":{"Type":18,"Flags":0,"Description":"A list of EC2 VPC security groups to associate with this DB cluster."}}}},{"3":{"ItemType":8}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":12}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.RDS/DBCluster","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":13,"Flags":0,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/DBCluster@default","ScopeType":0,"Body":19}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -."},"Value":{"Type":4,"Flags":0,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -."}}}},{"2":{"Name":"AWS.RDS/DBClusterParameterGroupProperties","Properties":{"DBClusterParameterGroupName":{"Type":4,"Flags":2},"Description":{"Type":4,"Flags":1,"Description":"A friendly description for this DB cluster parameter group."},"Family":{"Type":4,"Flags":1,"Description":"The DB cluster parameter group family name. A DB cluster parameter group can be associated with one and only one DB cluster parameter group family, and can be applied only to a DB cluster running a DB engine and engine version compatible with that DB cluster parameter group family."},"Parameters":{"Type":23,"Flags":5,"Description":"An array of parameters to be modified. A maximum of 20 parameters can be modified in a single request."},"Tags":{"Type":24,"Flags":0,"Description":"The list of tags for the cluster parameter group."}}}},{"2":{"Name":"DBClusterParameterGroup_Parameters","Properties":{}}},{"3":{"ItemType":21}},{"2":{"Name":"AWS.RDS/DBClusterParameterGroup","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":22,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/DBClusterParameterGroup@default","ScopeType":0,"Body":25}},{"2":{"Name":"DBInstanceRole","Properties":{"FeatureName":{"Type":4,"Flags":1,"Description":"The name of the feature associated with the AWS Identity and Access Management (IAM) role. IAM roles that are associated with a DB instance grant permission for the DB instance to access other AWS services on your behalf."},"RoleArn":{"Type":4,"Flags":1,"Description":"The Amazon Resource Name (ARN) of the IAM role that is associated with the DB instance."}}}},{"2":{"Name":"Endpoint","Properties":{"Address":{"Type":4,"Flags":2,"Description":"Specifies the DNS address of the DB instance."},"HostedZoneId":{"Type":4,"Flags":2,"Description":"Specifies the ID that Amazon Route 53 assigns when you create a hosted zone."},"Port":{"Type":4,"Flags":2,"Description":"Specifies the port that the database engine is listening on."}}}},{"2":{"Name":"ProcessorFeature","Properties":{"Name":{"Type":4,"Flags":0,"Description":"The name of the processor feature. Valid names are coreCount and threadsPerCore."},"Value":{"Type":4,"Flags":0,"Description":"The value of a processor feature name."}}}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "},"Value":{"Type":4,"Flags":0,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "}}}},{"2":{"Name":"AWS.RDS/DBInstanceProperties","Properties":{"AllocatedStorage":{"Type":4,"Flags":0,"Description":"The amount of storage (in gigabytes) to be initially allocated for the database instance."},"AllowMajorVersionUpgrade":{"Type":2,"Flags":0,"Description":"A value that indicates whether major version upgrades are allowed. Changing this parameter doesn't result in an outage and the change is asynchronously applied as soon as possible."},"AssociatedRoles":{"Type":32,"Flags":0,"Description":"The AWS Identity and Access Management (IAM) roles associated with the DB instance."},"AutoMinorVersionUpgrade":{"Type":2,"Flags":0,"Description":"A value that indicates whether minor engine upgrades are applied automatically to the DB instance during the maintenance window. By default, minor engine upgrades are applied automatically."},"AvailabilityZone":{"Type":4,"Flags":0,"Description":"The Availability Zone (AZ) where the database will be created. For information on AWS Regions and Availability Zones."},"BackupRetentionPeriod":{"Type":3,"Flags":0,"Description":"The number of days for which automated backups are retained. Setting this parameter to a positive number enables backups. Setting this parameter to 0 disables automated backups."},"CACertificateIdentifier":{"Type":4,"Flags":0,"Description":"The identifier of the CA certificate for this DB instance."},"CharacterSetName":{"Type":4,"Flags":0,"Description":"For supported engines, indicates that the DB instance should be associated with the specified character set."},"CopyTagsToSnapshot":{"Type":2,"Flags":0,"Description":"A value that indicates whether to copy tags from the DB instance to snapshots of the DB instance. By default, tags are not copied."},"DBClusterIdentifier":{"Type":4,"Flags":0,"Description":"The identifier of the DB cluster that the instance will belong to."},"DBInstanceClass":{"Type":4,"Flags":0,"Description":"The compute and memory capacity of the DB instance, for example, db.m4.large. Not all DB instance classes are available in all AWS Regions, or for all database engines."},"DBInstanceIdentifier":{"Type":4,"Flags":0,"Description":"A name for the DB instance. If you specify a name, AWS CloudFormation converts it to lowercase. If you don't specify a name, AWS CloudFormation generates a unique physical ID and uses that ID for the DB instance."},"DBName":{"Type":4,"Flags":0,"Description":"The meaning of this parameter differs according to the database engine you use."},"DBParameterGroupName":{"Type":4,"Flags":0,"Description":"The name of an existing DB parameter group or a reference to an AWS::RDS::DBParameterGroup resource created in the template."},"DBSecurityGroups":{"Type":33,"Flags":0,"Description":"A list of the DB security groups to assign to the DB instance. The list can include both the name of existing DB security groups or references to AWS::RDS::DBSecurityGroup resources created in the template."},"DBSnapshotIdentifier":{"Type":4,"Flags":4,"Description":"The name or Amazon Resource Name (ARN) of the DB snapshot that's used to restore the DB instance. If you're restoring from a shared manual DB snapshot, you must specify the ARN of the snapshot."},"DBSubnetGroupName":{"Type":4,"Flags":0,"Description":"A DB subnet group to associate with the DB instance. If you update this value, the new subnet group must be a subnet group in a new VPC."},"DeleteAutomatedBackups":{"Type":2,"Flags":0,"Description":"A value that indicates whether to remove automated backups immediately after the DB instance is deleted. This parameter isn't case-sensitive. The default is to remove automated backups immediately after the DB instance is deleted."},"DeletionProtection":{"Type":2,"Flags":0,"Description":"A value that indicates whether the DB instance has deletion protection enabled. The database can't be deleted when deletion protection is enabled. By default, deletion protection is disabled."},"Domain":{"Type":4,"Flags":0,"Description":"The Active Directory directory ID to create the DB instance in. Currently, only MySQL, Microsoft SQL Server, Oracle, and PostgreSQL DB instances can be created in an Active Directory Domain."},"DomainIAMRoleName":{"Type":4,"Flags":0,"Description":"Specify the name of the IAM role to be used when making API calls to the Directory Service."},"EnableCloudwatchLogsExports":{"Type":34,"Flags":0,"Description":"The list of log types that need to be enabled for exporting to CloudWatch Logs. The values in the list depend on the DB engine being used."},"EnableIAMDatabaseAuthentication":{"Type":2,"Flags":0,"Description":"A value that indicates whether to enable mapping of AWS Identity and Access Management (IAM) accounts to database accounts. By default, mapping is disabled."},"EnablePerformanceInsights":{"Type":2,"Flags":0,"Description":"A value that indicates whether to enable Performance Insights for the DB instance."},"Endpoint":{"Type":28,"Flags":0,"Description":"Specifies the connection endpoint."},"Engine":{"Type":4,"Flags":0,"Description":"The name of the database engine that you want to use for this DB instance."},"EngineVersion":{"Type":4,"Flags":0,"Description":"The version number of the database engine to use."},"Iops":{"Type":3,"Flags":0,"Description":"The number of I/O operations per second (IOPS) that the database provisions."},"KmsKeyId":{"Type":4,"Flags":0,"Description":"The ARN of the AWS Key Management Service (AWS KMS) master key that's used to encrypt the DB instance."},"LicenseModel":{"Type":4,"Flags":0,"Description":"License model information for this DB instance."},"MasterUserPassword":{"Type":4,"Flags":4,"Description":"The password for the master user."},"MasterUsername":{"Type":4,"Flags":0,"Description":"The master user name for the DB instance."},"MaxAllocatedStorage":{"Type":3,"Flags":0,"Description":"The upper limit to which Amazon RDS can automatically scale the storage of the DB instance."},"MonitoringInterval":{"Type":3,"Flags":0,"Description":"The interval, in seconds, between points when Enhanced Monitoring metrics are collected for the DB instance. To disable collecting Enhanced Monitoring metrics, specify 0. The default is 0."},"MonitoringRoleArn":{"Type":4,"Flags":0,"Description":"The ARN for the IAM role that permits RDS to send enhanced monitoring metrics to Amazon CloudWatch Logs."},"MultiAZ":{"Type":2,"Flags":0,"Description":"Specifies whether the database instance is a multiple Availability Zone deployment."},"OptionGroupName":{"Type":4,"Flags":0,"Description":"Indicates that the DB instance should be associated with the specified option group."},"PerformanceInsightsKMSKeyId":{"Type":4,"Flags":0,"Description":"The AWS KMS key identifier for encryption of Performance Insights data. The KMS key ID is the Amazon Resource Name (ARN), KMS key identifier, or the KMS key alias for the KMS encryption key."},"PerformanceInsightsRetentionPeriod":{"Type":3,"Flags":0,"Description":"The amount of time, in days, to retain Performance Insights data. Valid values are 7 or 731 (2 years)."},"Port":{"Type":4,"Flags":4,"Description":"The port number on which the database accepts connections."},"PreferredBackupWindow":{"Type":4,"Flags":0,"Description":"The daily time range during which automated backups are created if automated backups are enabled, using the BackupRetentionPeriod parameter."},"PreferredMaintenanceWindow":{"Type":4,"Flags":0,"Description":"he weekly time range during which system maintenance can occur, in Universal Coordinated Time (UTC)."},"ProcessorFeatures":{"Type":35,"Flags":0,"Description":"The number of CPU cores and the number of threads per core for the DB instance class of the DB instance."},"PromotionTier":{"Type":3,"Flags":0,"Description":"A value that specifies the order in which an Aurora Replica is promoted to the primary instance after a failure of the existing primary instance."},"PubliclyAccessible":{"Type":2,"Flags":0,"Description":"Indicates whether the DB instance is an internet-facing instance. If you specify true, AWS CloudFormation creates an instance with a publicly resolvable DNS name, which resolves to a public IP address. If you specify false, AWS CloudFormation creates an internal instance with a DNS name that resolves to a private IP address."},"SourceDBInstanceIdentifier":{"Type":4,"Flags":4,"Description":"If you want to create a Read Replica DB instance, specify the ID of the source DB instance. Each DB instance can have a limited number of Read Replicas."},"SourceRegion":{"Type":4,"Flags":4,"Description":"The ID of the region that contains the source DB instance for the Read Replica."},"StorageEncrypted":{"Type":2,"Flags":0,"Description":"A value that indicates whether the DB instance is encrypted. By default, it isn't encrypted."},"StorageType":{"Type":4,"Flags":0,"Description":"Specifies the storage type to be associated with the DB instance."},"Tags":{"Type":36,"Flags":0,"Description":"Tags to assign to the DB instance."},"TdeCredentialArn":{"Type":4,"Flags":0,"Description":"The ARN from the key store with which to associate the instance for TDE encryption."},"TdeCredentialPassword":{"Type":4,"Flags":4,"Description":"The password for the given ARN from the key store in order to access the device."},"Timezone":{"Type":4,"Flags":0,"Description":"The time zone of the DB instance. The time zone parameter is currently supported only by Microsoft SQL Server."},"UseDefaultProcessorFeatures":{"Type":2,"Flags":0,"Description":"A value that indicates whether the DB instance class of the DB instance uses its default processor features."},"VPCSecurityGroups":{"Type":37,"Flags":0,"Description":"A list of the VPC security group IDs to assign to the DB instance. The list can include both the physical IDs of existing VPC security groups and references to AWS::EC2::SecurityGroup resources created in the template."}}}},{"3":{"ItemType":27}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":29}},{"3":{"ItemType":30}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.RDS/DBInstance","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":31,"Flags":0,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/DBInstance@default","ScopeType":0,"Body":38}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -."},"Value":{"Type":4,"Flags":0,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -."}}}},{"2":{"Name":"AWS.RDS/DBParameterGroupProperties","Properties":{"DBParameterGroupName":{"Type":4,"Flags":2,"Description":"Specifies the name of the DB parameter group"},"Description":{"Type":4,"Flags":1,"Description":"Provides the customer-specified description for this DB parameter group."},"Family":{"Type":4,"Flags":1,"Description":"The DB parameter group family name."},"Parameters":{"Type":42,"Flags":4,"Description":"An array of parameter names and values for the parameter update."},"Tags":{"Type":43,"Flags":0,"Description":"An array of key-value pairs to apply to this resource."}}}},{"2":{"Name":"DBParameterGroup_Parameters","Properties":{}}},{"3":{"ItemType":40}},{"2":{"Name":"AWS.RDS/DBParameterGroup","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":41,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/DBParameterGroup@default","ScopeType":0,"Body":44}},{"2":{"Name":"AuthFormat","Properties":{"AuthScheme":{"Type":4,"Flags":0,"Description":"The type of authentication that the proxy uses for connections from the proxy to the underlying database. "},"Description":{"Type":4,"Flags":0,"Description":"A user-specified description about the authentication used by a proxy to log in as a specific database user. "},"IAMAuth":{"Type":4,"Flags":0,"Description":"Whether to require or disallow AWS Identity and Access Management (IAM) authentication for connections to the proxy. "},"SecretArn":{"Type":4,"Flags":0,"Description":"The Amazon Resource Name (ARN) representing the secret that the proxy uses to authenticate to the RDS DB instance or Aurora DB cluster. These secrets are stored within Amazon Secrets Manager. "},"UserName":{"Type":4,"Flags":0,"Description":"The name of the database user to which the proxy connects."}}}},{"2":{"Name":"TagFormat","Properties":{"Key":{"Type":4,"Flags":0},"Value":{"Type":4,"Flags":0}}}},{"2":{"Name":"AWS.RDS/DBProxyProperties","Properties":{"Auth":{"Type":49,"Flags":1,"Description":"The authorization mechanism that the proxy uses."},"DBProxyArn":{"Type":4,"Flags":2,"Description":"The Amazon Resource Name (ARN) for the proxy."},"DBProxyName":{"Type":4,"Flags":1,"Description":"The identifier for the proxy. This name must be unique for all proxies owned by your AWS account in the specified AWS Region."},"DebugLogging":{"Type":2,"Flags":0,"Description":"Whether the proxy includes detailed information about SQL statements in its logs."},"Endpoint":{"Type":4,"Flags":2,"Description":"The endpoint that you can use to connect to the proxy. You include the endpoint value in the connection string for a database client application."},"EngineFamily":{"Type":4,"Flags":1,"Description":"The kinds of databases that the proxy can connect to."},"IdleClientTimeout":{"Type":3,"Flags":0,"Description":"The number of seconds that a connection to the proxy can be inactive before the proxy disconnects it."},"RequireTLS":{"Type":2,"Flags":0,"Description":"A Boolean parameter that specifies whether Transport Layer Security (TLS) encryption is required for connections to the proxy."},"RoleArn":{"Type":4,"Flags":1,"Description":"The Amazon Resource Name (ARN) of the IAM role that the proxy uses to access secrets in AWS Secrets Manager."},"Tags":{"Type":50,"Flags":0,"Description":"An optional set of key-value pairs to associate arbitrary data of your choosing with the proxy."},"VpcSecurityGroupIds":{"Type":51,"Flags":0,"Description":"VPC security group IDs to associate with the new proxy."},"VpcSubnetIds":{"Type":52,"Flags":1,"Description":"VPC subnet IDs to associate with the new proxy."}}}},{"3":{"ItemType":46}},{"3":{"ItemType":47}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.RDS/DBProxy","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":48,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/DBProxy@default","ScopeType":0,"Body":53}},{"2":{"Name":"TagFormat","Properties":{"Key":{"Type":4,"Flags":0},"Value":{"Type":4,"Flags":0}}}},{"2":{"Name":"AWS.RDS/DBProxyEndpointProperties","Properties":{"DBProxyEndpointArn":{"Type":4,"Flags":2,"Description":"The Amazon Resource Name (ARN) for the DB proxy endpoint."},"DBProxyEndpointName":{"Type":4,"Flags":1,"Description":"The identifier for the DB proxy endpoint. This name must be unique for all DB proxy endpoints owned by your AWS account in the specified AWS Region."},"DBProxyName":{"Type":4,"Flags":1,"Description":"The identifier for the proxy. This name must be unique for all proxies owned by your AWS account in the specified AWS Region."},"Endpoint":{"Type":4,"Flags":2,"Description":"The endpoint that you can use to connect to the DB proxy. You include the endpoint value in the connection string for a database client application."},"IsDefault":{"Type":2,"Flags":2,"Description":"A value that indicates whether this endpoint is the default endpoint for the associated DB proxy. Default DB proxy endpoints always have read/write capability. Other endpoints that you associate with the DB proxy can be either read/write or read-only."},"Tags":{"Type":57,"Flags":0,"Description":"An optional set of key-value pairs to associate arbitrary data of your choosing with the DB proxy endpoint."},"TargetRole":{"Type":4,"Flags":0,"Description":"A value that indicates whether the DB proxy endpoint can be used for read/write or read-only operations."},"VpcId":{"Type":4,"Flags":2,"Description":"VPC ID to associate with the new DB proxy endpoint."},"VpcSecurityGroupIds":{"Type":58,"Flags":0,"Description":"VPC security group IDs to associate with the new DB proxy endpoint."},"VpcSubnetIds":{"Type":59,"Flags":1,"Description":"VPC subnet IDs to associate with the new DB proxy endpoint."}}}},{"3":{"ItemType":55}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.RDS/DBProxyEndpoint","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":56,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/DBProxyEndpoint@default","ScopeType":0,"Body":60}},{"2":{"Name":"ConnectionPoolConfigurationInfoFormat","Properties":{"ConnectionBorrowTimeout":{"Type":3,"Flags":0,"Description":"The number of seconds for a proxy to wait for a connection to become available in the connection pool."},"InitQuery":{"Type":4,"Flags":0,"Description":"One or more SQL statements for the proxy to run when opening each new database connection."},"MaxConnectionsPercent":{"Type":3,"Flags":0,"Description":"The maximum size of the connection pool for each target in a target group."},"MaxIdleConnectionsPercent":{"Type":3,"Flags":0,"Description":"Controls how actively the proxy closes idle database connections in the connection pool."},"SessionPinningFilters":{"Type":63,"Flags":0,"Description":"Each item in the list represents a class of SQL operations that normally cause all later statements in a session using a proxy to be pinned to the same underlying database connection."}}}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.RDS/DBProxyTargetGroupProperties","Properties":{"ConnectionPoolConfigurationInfo":{"Type":62,"Flags":0},"DBClusterIdentifiers":{"Type":65,"Flags":0},"DBInstanceIdentifiers":{"Type":66,"Flags":0},"DBProxyName":{"Type":4,"Flags":1,"Description":"The identifier for the proxy."},"TargetGroupArn":{"Type":4,"Flags":2,"Description":"The Amazon Resource Name (ARN) representing the target group."},"TargetGroupName":{"Type":4,"Flags":1,"Description":"The identifier for the DBProxyTargetGroup"}}}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.RDS/DBProxyTargetGroup","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":64,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/DBProxyTargetGroup@default","ScopeType":0,"Body":67}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "},"Value":{"Type":4,"Flags":0,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "}}}},{"2":{"Name":"AWS.RDS/DBSubnetGroupProperties","Properties":{"DBSubnetGroupDescription":{"Type":4,"Flags":1},"DBSubnetGroupName":{"Type":4,"Flags":0},"SubnetIds":{"Type":71,"Flags":5},"Tags":{"Type":72,"Flags":0,"Description":"An array of key-value pairs to apply to this resource."}}}},{"3":{"ItemType":4}},{"3":{"ItemType":69}},{"2":{"Name":"AWS.RDS/DBSubnetGroup","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":70,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/DBSubnetGroup@default","ScopeType":0,"Body":73}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -."},"Value":{"Type":4,"Flags":0,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -."}}}},{"2":{"Name":"AWS.RDS/EventSubscriptionProperties","Properties":{"Enabled":{"Type":2,"Flags":0,"Description":"A Boolean value; set to true to activate the subscription, set to false to create the subscription but not active it."},"EventCategories":{"Type":77,"Flags":0,"Description":"A list of event categories for a SourceType that you want to subscribe to. You can see a list of the categories for a given SourceType in the Events topic in the Amazon RDS User Guide or by using the DescribeEventCategories action."},"SnsTopicArn":{"Type":4,"Flags":1,"Description":"The Amazon Resource Name (ARN) of the SNS topic created for event notification. The ARN is created by Amazon SNS when you create a topic and subscribe to it."},"SourceIds":{"Type":78,"Flags":0,"Description":"The list of identifiers of the event sources for which events will be returned. If not specified, then all sources are included in the response. An identifier must begin with a letter and must contain only ASCII letters, digits, and hyphens; it cannot end with a hyphen or contain two consecutive hyphens."},"SourceType":{"Type":4,"Flags":0,"Description":"The type of source that will be generating the events. For example, if you want to be notified of events generated by a DB instance, you would set this parameter to db-instance. if this value is not specified, all events are returned."},"SubscriptionName":{"Type":4,"Flags":0,"Description":"The name of the subscription."},"Tags":{"Type":79,"Flags":0,"Description":"An array of key-value pairs to apply to this resource."}}}},{"3":{"ItemType":4}},{"3":{"ItemType":4}},{"3":{"ItemType":75}},{"2":{"Name":"AWS.RDS/EventSubscription","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":76,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/EventSubscription@default","ScopeType":0,"Body":80}},{"2":{"Name":"AWS.RDS/GlobalClusterProperties","Properties":{"DeletionProtection":{"Type":2,"Flags":0,"Description":"The deletion protection setting for the new global database. The global database can't be deleted when deletion protection is enabled."},"Engine":{"Type":4,"Flags":0,"Description":"The name of the database engine to be used for this DB cluster. Valid Values: aurora (for MySQL 5.6-compatible Aurora), aurora-mysql (for MySQL 5.7-compatible Aurora).\nIf you specify the SourceDBClusterIdentifier property, don't specify this property. The value is inherited from the cluster."},"EngineVersion":{"Type":4,"Flags":0,"Description":"The version number of the database engine to use. If you specify the SourceDBClusterIdentifier property, don't specify this property. The value is inherited from the cluster."},"GlobalClusterIdentifier":{"Type":4,"Flags":0,"Description":"The cluster identifier of the new global database cluster. This parameter is stored as a lowercase string."},"SourceDBClusterIdentifier":{"Type":4,"Flags":0,"Description":"The Amazon Resource Name (ARN) to use as the primary cluster of the global database. This parameter is optional. This parameter is stored as a lowercase string."},"StorageEncrypted":{"Type":2,"Flags":0,"Description":" The storage encryption setting for the new global database cluster.\nIf you specify the SourceDBClusterIdentifier property, don't specify this property. The value is inherited from the cluster."}}}},{"2":{"Name":"AWS.RDS/GlobalCluster","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":82,"Flags":0,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/GlobalCluster@default","ScopeType":0,"Body":83}},{"2":{"Name":"OptionConfiguration","Properties":{"DBSecurityGroupMemberships":{"Type":88,"Flags":0,"Description":"A list of DBSecurityGroupMembership name strings used for this option."},"OptionName":{"Type":4,"Flags":1,"Description":"The configuration of options to include in a group."},"OptionSettings":{"Type":89,"Flags":0,"Description":"The option settings to include in an option group."},"OptionVersion":{"Type":4,"Flags":0,"Description":"The version for the option."},"Port":{"Type":3,"Flags":0,"Description":"The optional port for the option."},"VpcSecurityGroupMemberships":{"Type":90,"Flags":0,"Description":"A list of VpcSecurityGroupMembership name strings used for this option."}}}},{"2":{"Name":"OptionSetting","Properties":{"Name":{"Type":4,"Flags":0,"Description":"The name of the option that has settings that you can set."},"Value":{"Type":4,"Flags":0,"Description":"The current value of the option setting."}}}},{"2":{"Name":"Tag","Properties":{"Key":{"Type":4,"Flags":1,"Description":"The key name of the tag. You can specify a value that is 1 to 128 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "},"Value":{"Type":4,"Flags":0,"Description":"The value for the tag. You can specify a value that is 0 to 256 Unicode characters in length and cannot be prefixed with aws:. You can use any of the following characters: the set of Unicode letters, digits, whitespace, _, ., /, =, +, and -. "}}}},{"3":{"ItemType":4}},{"3":{"ItemType":86}},{"3":{"ItemType":4}},{"2":{"Name":"AWS.RDS/OptionGroupProperties","Properties":{"EngineName":{"Type":4,"Flags":1,"Description":"Indicates the name of the engine that this option group can be applied to."},"MajorEngineVersion":{"Type":4,"Flags":1,"Description":"Indicates the major engine version associated with this option group."},"OptionConfigurations":{"Type":92,"Flags":0,"Description":"Indicates what options are available in the option group."},"OptionGroupDescription":{"Type":4,"Flags":1,"Description":"Provides a description of the option group."},"OptionGroupName":{"Type":4,"Flags":2,"Description":"Specifies the name of the option group."},"Tags":{"Type":93,"Flags":0,"Description":"An array of key-value pairs to apply to this resource."}}}},{"3":{"ItemType":85}},{"3":{"ItemType":87}},{"2":{"Name":"AWS.RDS/OptionGroup","Properties":{"name":{"Type":4,"Flags":1,"Description":"the resource name"},"properties":{"Type":91,"Flags":1,"Description":"properties of the resource"}}}},{"4":{"Name":"AWS.RDS/OptionGroup@default","ScopeType":0,"Body":94}}]